Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PWR</name>
			<description>Power control</description>
			<groupName>PWR</groupName>
			<baseAddress>0x40007000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTLR</name>
					<displayName>CTLR</displayName>
					<description>Power control register (PWR_CTRL)</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPDS</name>
							<description>Low Power Deep Sleep</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVDE</name>
							<description>Power Voltage Detector Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLS</name>
							<description>PVD Level Selection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DBP</name>
							<description>Disable Backup Domain write protection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VIO_SW_CR</name>
							<description>VIO18 power regulation mode selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VSEL_VIO18</name>
							<description>VIO18 power supply adjustment position</description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>Power control register (PWR_CSR)</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PVDO</name>
							<description>PVD Output</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VIO18_SR</name>
							<description>VIO18 power supply initial status indicator</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>CRC</name>
			<description>CRC calculation unit</description>
			<groupName>CRC</groupName>
			<baseAddress>0x40023000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DATAR</name>
					<displayName>DATAR</displayName>
					<description>Data register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>DR</name>
							<description>Data Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDATAR</name>
					<displayName>IDATAR</displayName>
					<description>Independent Data register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>IDR</name>
							<description>Independent Data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLR</name>
					<displayName>CTLR</displayName>
					<description>Control register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RESET</name>
							<description>Reset bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<description>Real time clock</description>
			<groupName>RTC</groupName>
			<baseAddress>0x40002800</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<description>RTC global interrupt</description>
				<value>143</value>
			</interrupt>
			<interrupt>
				<name>RTCAlarm</name>
				<description>RTC Alarm-clock interrupt</description>
				<value>66</value>
			</interrupt>
			<registers>
				<register>
					<name>CTLRH</name>
					<displayName>CTLRH</displayName>
					<description>RTC Control Register High</description>
					<addressOffset>0x00</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SECIE</name>
							<description>Second interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALRIE</name>
							<description>Alarm interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OWIE</name>
							<description>Overflow interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLRL</name>
					<displayName>CTLRL</displayName>
					<description>RTC Control Register Low</description>
					<addressOffset>0x04</addressOffset>
					<size>0x10</size>
					<resetValue>0x0020</resetValue>
					<fields>
						<field>
							<name>SECF</name>
							<description>Second Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALRF</name>
							<description>Alarm Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OWF</name>
							<description>Overflow Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSF</name>
							<description>Registers Synchronized Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF</name>
							<description>Configuration Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTOFF</name>
							<description>RTC operation OFF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSCRH</name>
					<displayName>PSCRH</displayName>
					<description>RTC Prescaler Load Register High</description>
					<addressOffset>0x08</addressOffset>
					<size>0x10</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PRL</name>
							<description>RTC Prescaler Load Register High</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSCRL</name>
					<displayName>PSCRL</displayName>
					<description>RTC Prescaler Load Register Low</description>
					<addressOffset>0xC</addressOffset>
					<size>0x10</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PRL</name>
							<description>RTC Prescaler Divider Register Low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DIVH</name>
					<displayName>DIVH</displayName>
					<description>RTC Prescaler Divider Register High</description>
					<addressOffset>0x10</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DIV</name>
							<description>RTC prescaler divider register high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DIVL</name>
					<displayName>DIVL</displayName>
					<description>RTC Prescaler Divider Register Low</description>
					<addressOffset>0x14</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DIV</name>
							<description>RTC prescaler divider register Low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTH</name>
					<displayName>CNTH</displayName>
					<description>RTC Counter Register High</description>
					<addressOffset>0x18</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CNTH</name>
							<description>RTC counter register high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTL</name>
					<displayName>CNTL</displayName>
					<description>RTC Counter Register Low</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CNTL</name>
							<description>RTC counter register Low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ALRMH</name>
					<displayName>ALRMH</displayName>
					<description>RTC Alarm Register High</description>
					<addressOffset>0x20</addressOffset>
					<size>0x10</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ALR</name>
							<description>RTC alarm register high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ALRML</name>
					<displayName>ALRML</displayName>
					<description>RTC Alarm Register Low</description>
					<addressOffset>0x24</addressOffset>
					<size>0x10</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ALR</name>
							<description>RTC alarm register low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
