Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>BCR</name>
					<displayName>BCR</displayName>
					<description>Port bit reset register (GPIOn_BCR)</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BR0</name>
							<description>Reset bit 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR1</name>
							<description>Reset bit 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR2</name>
							<description>Reset bit 1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR3</name>
							<description>Reset bit 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR4</name>
							<description>Reset bit 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR5</name>
							<description>Reset bit 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR6</name>
							<description>Reset bit 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR7</name>
							<description>Reset bit 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR8</name>
							<description>Reset bit 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR9</name>
							<description>Reset bit 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR10</name>
							<description>Reset bit 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR11</name>
							<description>Reset bit 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR12</name>
							<description>Reset bit 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR13</name>
							<description>Reset bit 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR14</name>
							<description>Reset bit 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR15</name>
							<description>Reset bit 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LCKR</name>
					<displayName>LCKR</displayName>
					<description>Port configuration lock register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LCK0</name>
							<description>Port A Lock bit 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK1</name>
							<description>Port A Lock bit 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK2</name>
							<description>Port A Lock bit 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK3</name>
							<description>Port A Lock bit 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK4</name>
							<description>Port A Lock bit 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK5</name>
							<description>Port A Lock bit 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK6</name>
							<description>Port A Lock bit 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK7</name>
							<description>Port A Lock bit 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK8</name>
							<description>Port A Lock bit 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK9</name>
							<description>Port A Lock bit 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK10</name>
							<description>Port A Lock bit 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK11</name>
							<description>Port A Lock bit 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK12</name>
							<description>Port A Lock bit 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK13</name>
							<description>Port A Lock bit 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK14</name>
							<description>Port A Lock bit 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK15</name>
							<description>Port A Lock bit 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCKK</name>
							<description>Lock key</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
