Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOB</name>
			<baseAddress>0x40010C00</baseAddress>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOC</name>
			<baseAddress>0x40011000</baseAddress>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOD</name>
			<baseAddress>0x40011400</baseAddress>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOE</name>
			<baseAddress>0x40011800</baseAddress>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOF</name>
			<baseAddress>0x40011C00</baseAddress>
		</peripheral>
		<peripheral>
			<name>AFIO</name>
			<description>Alternate function I/O</description>
			<groupName>AFIO</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PCFR1</name>
					<displayName>PCFR1</displayName>
					<description>AF remap and debug I/O configuration register (AFIO_PCFR1)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD0PD1_RM</name>
							<description>PD0PD1 remapping</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC1_ETRGINJ_RM</name>
							<description>ADC1_ETRGINJ remapping</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC1_ETRGREG_RM</name>
							<description>ADC1_ETRGREG remapping</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC2_ETRGINJ_RM</name>
							<description>ADC2_ETRGINJ remapping</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC2_ETRGREG_RM</name>
							<description>ADC2_ETRGREG remapping</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UHSIF_CLK_RM</name>
							<description>UHSIF_CLK remapping</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UHSIF_PORT_RM</name>
							<description>UHSIF_PORT remapping</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDMMC_RM</name>
							<description>SDMMC remapping</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM2ITR1_RM</name>
							<description>TIM2ITR1 remapping</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VIO18_IO_HSLV</name>
							<description>VIO18 IO speed configuration at low voltage</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VIO33_IO_HSLV</name>
							<description>VIO33 IO speed configuration at low voltage</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDD33_IO_HSLV</name>
							<description>VDD33 IO speed configuration at low voltage</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USBPD_CC_HVT</name>
							<description>CC pin intput channel threshold adjustment</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SW_CFG</name>
							<description>Serial wire JTAG configuration</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOA_AFLR</name>
					<displayName>GPIOA_AFLR</displayName>
					<description>PA port multiplexing function register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR0</name>
							<description>selection of multiplexing function for pin 0 of PA port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR1</name>
							<description>selection of multiplexing function for pin 1 of PA port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR2</name>
							<description>selection of multiplexing function for pin 2 of PA port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR3</name>
							<description>selection of multiplexing function for pin 3 of PA port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR4</name>
							<description>selection of multiplexing function for pin 4 of PA port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR5</name>
							<description>selection of multiplexing function for pin 5 of PA port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR6</name>
							<description>selection of multiplexing function for pin 6 of PA port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR7</name>
							<description>selection of multiplexing function for pin 7 of PA port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOA_AFHR</name>
					<displayName>GPIOA_AFHR</displayName>
					<description>PA port multiplexing function register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR8</name>
							<description>selection of multiplexing function for pin 8 of PA port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR9</name>
							<description>selection of multiplexing function for pin 9 of PA port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR10</name>
							<description>selection of multiplexing function for pin 10 of PA port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR11</name>
							<description>selection of multiplexing function for pin 11 of PA port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR12</name>
							<description>selection of multiplexing function for pin 12 of PA port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR13</name>
							<description>selection of multiplexing function for pin 13 of PA port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR14</name>
							<description>selection of multiplexing function for pin 14 of PA port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR15</name>
							<description>selection of multiplexing function for pin 15 of PA port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_AFLR</name>
					<displayName>GPIOB_AFLR</displayName>
					<description>PB port multiplexing function register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR0</name>
							<description>selection of multiplexing function for pin 0 of PB port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR1</name>
							<description>selection of multiplexing function for pin 1 of PB port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR2</name>
							<description>selection of multiplexing function for pin 2 of PB port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR3</name>
							<description>selection of multiplexing function for pin 3 of PB port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR4</name>
							<description>selection of multiplexing function for pin 4 of PB port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR5</name>
							<description>selection of multiplexing function for pin 5 of PB port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR6</name>
							<description>selection of multiplexing function for pin 6 of PB port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR7</name>
							<description>selection of multiplexing function for pin 7 of PB port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_AFHR</name>
					<displayName>GPIOB_AFHR</displayName>
					<description>PB port multiplexing function register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR8</name>
							<description>selection of multiplexing function for pin 8 of PA port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR9</name>
							<description>selection of multiplexing function for pin 9 of PB port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR10</name>
							<description>selection of multiplexing function for pin 10 of PB port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR11</name>
							<description>selection of multiplexing function for pin 11 of PB port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR12</name>
							<description>selection of multiplexing function for pin 12 of PB port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR13</name>
							<description>selection of multiplexing function for pin 13 of PB port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR14</name>
							<description>selection of multiplexing function for pin 14 of PB port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR15</name>
							<description>selection of multiplexing function for pin 15 of PB port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOC_AFLR</name>
					<displayName>GPIOC_AFLR</displayName>
					<description>PC port multiplexing function register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR0</name>
							<description>selection of multiplexing function for pin 0 of PC port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR1</name>
							<description>selection of multiplexing function for pin 1 of PC port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR2</name>
							<description>selection of multiplexing function for pin 2 of PC port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR3</name>
							<description>selection of multiplexing function for pin 3 of PC port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR4</name>
							<description>selection of multiplexing function for pin 4 of PC port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR5</name>
							<description>selection of multiplexing function for pin 5 of PC port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR6</name>
							<description>selection of multiplexing function for pin 6 of PC port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR7</name>
							<description>selection of multiplexing function for pin 7 of PC port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOC_AFHR</name>
					<displayName>GPIOC_AFHR</displayName>
					<description>PC port multiplexing function register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR8</name>
							<description>selection of multiplexing function for pin 8 of PC port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR9</name>
							<description>selection of multiplexing function for pin 9 of PC port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR10</name>
							<description>selection of multiplexing function for pin 10 of PC port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR11</name>
							<description>selection of multiplexing function for pin 11 of PC port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR12</name>
							<description>selection of multiplexing function for pin 12 of PC port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR13</name>
							<description>selection of multiplexing function for pin 13 of PC port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR14</name>
							<description>selection of multiplexing function for pin 14 of PC port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR15</name>
							<description>selection of multiplexing function for pin 15 of PC port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOD_AFLR</name>
					<displayName>GPIOD_AFLR</displayName>
					<description>PD port multiplexing function register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR0</name>
							<description>selection of multiplexing function for pin 0 of PD port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR1</name>
							<description>selection of multiplexing function for pin 1 of PD port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR2</name>
							<description>selection of multiplexing function for pin 2 of PD port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR3</name>
							<description>selection of multiplexing function for pin 3 of PA port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR4</name>
							<description>selection of multiplexing function for pin 4 of PD port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR5</name>
							<description>selection of multiplexing function for pin 5 of PD port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR6</name>
							<description>selection of multiplexing function for pin 6 of PD port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR7</name>
							<description>selection of multiplexing function for pin 7 of PD port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOD_AFHR</name>
					<displayName>GPIOD_AFHR</displayName>
					<description>PD port multiplexing function register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR8</name>
							<description>selection of multiplexing function for pin 8 of PD port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR9</name>
							<description>selection of multiplexing function for pin 9 of PD port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR10</name>
							<description>selection of multiplexing function for pin 10 of PD port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR11</name>
							<description>selection of multiplexing function for pin 11 of PD port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR12</name>
							<description>selection of multiplexing function for pin 12 of PD port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR13</name>
							<description>selection of multiplexing function for pin 13 of PD port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR14</name>
							<description>selection of multiplexing function for pin 14 of PD port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR15</name>
							<description>selection of multiplexing function for pin 15 of PD port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
