Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>GPIOE_AFLR</name>
					<displayName>GPIOE_AFLR</displayName>
					<description>PE port multiplexing function register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR0</name>
							<description>selection of multiplexing function for pin 0 of PE port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR1</name>
							<description>selection of multiplexing function for pin 1 of PE port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR2</name>
							<description>selection of multiplexing function for pin 2 of PE port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR3</name>
							<description>selection of multiplexing function for pin 3 of PE port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR4</name>
							<description>selection of multiplexing function for pin 4 of PE port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR5</name>
							<description>selection of multiplexing function for pin 5 of PE port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR6</name>
							<description>selection of multiplexing function for pin 6 of PE port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR7</name>
							<description>selection of multiplexing function for pin 7 of PE port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOE_AFHR</name>
					<displayName>GPIOE_AFHR</displayName>
					<description>PA port multiplexing function register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR8</name>
							<description>selection of multiplexing function for pin 8 of PE port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR9</name>
							<description>selection of multiplexing function for pin 9 of PE port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR10</name>
							<description>selection of multiplexing function for pin 10 of PE port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR11</name>
							<description>selection of multiplexing function for pin 11 of PE port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR12</name>
							<description>selection of multiplexing function for pin 12 of PE port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR13</name>
							<description>selection of multiplexing function for pin 13 of PE port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR14</name>
							<description>selection of multiplexing function for pin 14 of PE port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR15</name>
							<description>selection of multiplexing function for pin 15 of PE port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_AFLR</name>
					<displayName>GPIOF_AFLR</displayName>
					<description>PF port multiplexing function register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR0</name>
							<description>selection of multiplexing function for pin 0 of PF port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR1</name>
							<description>selection of multiplexing function for pin 1 of PF port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR2</name>
							<description>selection of multiplexing function for pin 2 of PF port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR3</name>
							<description>selection of multiplexing function for pin 3 of PF port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR4</name>
							<description>selection of multiplexing function for pin 4 of PF port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR5</name>
							<description>selection of multiplexing function for pin 5 of PF port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR6</name>
							<description>selection of multiplexing function for pin 6 of PF port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR7</name>
							<description>selection of multiplexing function for pin 7 of PF port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_AFHR</name>
					<displayName>GPIOF_AFHR</displayName>
					<description>PF port multiplexing function register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR8</name>
							<description>selection of multiplexing function for pin 8 of PF port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR9</name>
							<description>selection of multiplexing function for pin 9 of PF port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR10</name>
							<description>selection of multiplexing function for pin 10 of PF port</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR11</name>
							<description>selection of multiplexing function for pin 11 of PF port</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR12</name>
							<description>selection of multiplexing function for pin 12 of PF port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR13</name>
							<description>selection of multiplexing function for pin 13 of PF port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR14</name>
							<description>selection of multiplexing function for pin 14 of PF port</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR15</name>
							<description>selection of multiplexing function for pin 15 of PE port</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR1</name>
					<displayName>EXTICR1</displayName>
					<description>External interrupt configuration register 1</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI0</name>
							<description>External interrupt 0 input pin configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI1</name>
							<description>External interrupt 1 input pin configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI2</name>
							<description>External interrupt 2 input pin configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI3</name>
							<description>External interrupt 3 input pin configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI4</name>
							<description>External interrupt 4 input pin configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI5</name>
							<description>External interrupt 5 input pin configuration</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI6</name>
							<description>External interrupt 6 input pin configuration</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI7</name>
							<description>External interrupt 7 input pin configuration</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR2</name>
					<displayName>EXTICR2</displayName>
					<description>External interrupt configuration register 2</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI8</name>
							<description>External interrupt 8 input pin configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI9</name>
							<description>External interrupt 9 input pin configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI10</name>
							<description>External interrupt 10 input pin configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI11</name>
							<description>External interrupt 11 input pin configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI12</name>
							<description>External interrupt 12 input pin configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI13</name>
							<description>External interrupt 13 input pin configuration</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI14</name>
							<description>External interrupt 14 input pin configuration</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXTI15</name>
							<description>External interrupt 15 input pin configuration</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
