Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>IDATAR1_CHGOFFSET</name>
					<displayName>IDATAR1_CHGOFFSET</displayName>
					<description>injected data register x_Charge data offset for injected channel x</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IDATA_TKCGOFFSET</name>
							<description>Injected data_Touch key charge data offset for injected channel x</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDATAR2</name>
					<displayName>IDATAR2</displayName>
					<description>injected data register x</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA</name>
							<description>Injected data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDATAR3</name>
					<displayName>IDATAR3</displayName>
					<description>injected data register x</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA</name>
							<description>Injected data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDATAR4</name>
					<displayName>IDATAR4</displayName>
					<description>injected data register x</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA</name>
							<description>Injected data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RDATAR_DR</name>
					<displayName>RDATAR_DR</displayName>
					<description>regular data register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA0_7</name>
							<description>Regular data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DATA8_15</name>
							<description>Regular data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ADC2DATA</name>
							<description>converter data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ACT_DCG</name>
					<displayName>ACT_DCG</displayName>
					<description>start and discharge time register</description>
					<addressOffset>0x4C</addressOffset>
					<alternateRegister>RDATAR_DR</alternateRegister>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TKACT_DCG</name>
							<description>Touch key start and discharge time register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AUX</name>
					<displayName>ADCx_AUX</displayName>
					<description>ADC time register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADC_SMP_SEL0</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL1</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL2</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL3</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL4</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL5</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL6</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL7</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL8</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL9</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL10</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL11</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL12</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL13</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL14</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL15</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL16</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_SMP_SEL17</name>
							<description>channel sampling time optional enable bit</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_TO_DFSDM</name>
							<description>ADC module samples data to DFSDM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
