Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>CCER</name>
					<displayName>CCER</displayName>
					<description>capture/compare enable register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC4P</name>
							<description>Capture/Compare 3 output Polarity</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC4E</name>
							<description>Capture/Compare 4 output enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3NP</name>
							<description>Capture/Compare 3 output Polarity</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3NE</name>
							<description>Capture/Compare 3 complementary output enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3P</name>
							<description>Capture/Compare 3 output Polarity</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3E</name>
							<description>Capture/Compare 3 output enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2NP</name>
							<description>Capture/Compare 2 output Polarity</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2NE</name>
							<description>Capture/Compare 2 complementary output enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2P</name>
							<description>Capture/Compare 2 output Polarity</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2E</name>
							<description>Capture/Compare 2 output enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1NP</name>
							<description>Capture/Compare 1 output Polarity</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1NE</name>
							<description>Capture/Compare 1 complementary output enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1P</name>
							<description>Capture/Compare 1 output Polarity</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1E</name>
							<description>Capture/Compare 1 output enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>counter</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>prescaler</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>Prescaler value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ATRLR</name>
					<displayName>ATRLR</displayName>
					<description>auto-reload register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<name>ATRLR</name>
							<description>Auto-reload value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RPTCR</name>
					<displayName>RPTCR</displayName>
					<description>repetition counter register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RPTCR</name>
							<description>Repetition counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH1CVR</name>
					<displayName>CH1CVR</displayName>
					<description>capture/compare register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CH1CVR</name>
							<description>Capture/Compare 1 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LEVEL1</name>
							<description>Level indicating bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH2CVR</name>
					<displayName>CH2CVR</displayName>
					<description>capture/compare register 2</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CH2CVR</name>
							<description>Capture/Compare 2 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LEVEL2</name>
							<description>Level indicating bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH3CVR</name>
					<displayName>CH3CVR</displayName>
					<description>capture/compare register 3</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CH3CVR</name>
							<description>Capture/Compare value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LEVEL3</name>
							<description>Level indicating bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH4CVR</name>
					<displayName>CH4CVR</displayName>
					<description>capture/compare register 4</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CH4CVR</name>
							<description>Capture/Compare value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LEVEL4</name>
							<description>Level indicating bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BDTR</name>
					<displayName>BDTR</displayName>
					<description>break and dead-time register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>MOE</name>
							<description>Main output enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AOE</name>
							<description>Automatic output enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKP</name>
							<description>Break polarity</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKE</name>
							<description>Break enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OSSR</name>
							<description>Off-state selection for Run mode</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OSSI</name>
							<description>Off-state selection for Idle mode</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DTG</name>
							<description>Dead-time generator setup</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACFGR</name>
					<displayName>DMACFGR</displayName>
					<description>DMA control register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DBL</name>
							<description>DMA burst length</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DBA</name>
							<description>DMA base address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAADR</name>
					<displayName>DMAADR</displayName>
					<description>DMA address for full transfer</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DMAB</name>
							<description>DMA register for burst accesses</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AUX</name>
					<displayName>AUX</displayName>
					<description>Double-side egde capture register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CAP_ED_CH2</name>
							<description>Double-side egde capture is enable for channel2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAP_ED_CH3</name>
							<description>Double-side egde capture is enable for channel3</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAP_ED_CH4</name>
							<description>Double-side egde capture is enable for channel4</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BK_SEL</name>
							<description>Break source selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DTP_MODE</name>
							<description>The dead-time duration of the DT_VLU2 enabled setting occurs on the rising edge of OCXREF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTN_MODE</name>
							<description>The dead-time duration of the DT_VLU2 enabled setting occurs on the falling edge of OCXREF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DT_VLU2</name>
							<description>set the duration of the dead zone</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
