Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="I2C1">
			<name>I2C2</name>
			<baseAddress>0x40005800</baseAddress>
			<interrupt>
				<name>I2C2_EV</name>
				<description>I2C2 event interrupt</description>
				<value>52</value>
			</interrupt>
			<interrupt>
				<name>I2C2_ER</name>
				<description>I2C2 error interrupt</description>
				<value>53</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="I2C1">
			<name>I2C3</name>
			<baseAddress>0x40005C00</baseAddress>
			<interrupt>
				<name>I2C3_EV</name>
				<description>I2C3 event interrupt</description>
				<value>78</value>
			</interrupt>
			<interrupt>
				<name>I2C3_ER</name>
				<description>I2C3 error interrupt</description>
				<value>79</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="I2C1">
			<name>I2C4</name>
			<baseAddress>0x40014000</baseAddress>
			<interrupt>
				<name>I2C4_EV</name>
				<description>I2C4 event interrupt</description>
				<value>80</value>
			</interrupt>
			<interrupt>
				<name>I2C4_ER</name>
				<description>I2C4 error interrupt</description>
				<value>81</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>SPI1</name>
			<description>Serial peripheral interface</description>
			<groupName>SPI</groupName>
			<baseAddress>0x40013000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI1</name>
				<description>SPI1 global interrupt</description>
				<value>37</value>
			</interrupt>
			<registers>
				<register>
					<name>CTLR1</name>
					<displayName>CTLR1</displayName>
					<description>control register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>BIDIMODE</name>
							<description>Bidirectional data mode enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BIDIOE</name>
							<description>Output enable in bidirectional mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRCEN</name>
							<description>Hardware CRC calculation enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRCNEXT</name>
							<description>CRC transfer next</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFF</name>
							<description>Data frame format</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXONLY</name>
							<description>Receive only</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SSM</name>
							<description>Software slave management</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SSI</name>
							<description>Internal slave select</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSBFIRST</name>
							<description>Frame format</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPE</name>
							<description>SPI enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR</name>
							<description>Baud rate control</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MSTR</name>
							<description>Master selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock polarity</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPHA</name>
							<description>Clock phase</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLR2</name>
					<displayName>CTLR2</displayName>
					<description>control register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TXEIE</name>
							<description>Tx buffer empty interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXNEIE</name>
							<description>RX buffer not empty interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRIE</name>
							<description>Error interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SSOE</name>
							<description>SS output enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXDMAEN</name>
							<description>Tx buffer DMA enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXDMAEN</name>
							<description>Rx buffer DMA enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STATR</name>
					<displayName>STATR</displayName>
					<description>status register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x10</size>
					<resetValue>0x0002</resetValue>
					<fields>
						<field>
							<name>BSY</name>
							<description>Busy flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR</name>
							<description>Overrun flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODF</name>
							<description>Mode fault</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRCERR</name>
							<description>CRC error flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UDR</name>
							<description>Underrun flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHSID</name>
							<description>Channel side</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXE</name>
							<description>Transmit buffer empty</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXNE</name>
							<description>Receive buffer not empty</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATAR</name>
					<displayName>DATAR</displayName>
					<description>data register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DR</name>
							<description>Data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CRCR</name>
					<displayName>CRCR</displayName>
					<description>CRCR polynomial register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0007</resetValue>
					<fields>
						<field>
							<name>CRCPOLY</name>
							<description>CRC polynomial register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCRCR</name>
					<displayName>RCRCR</displayName>
					<description>RX CRC register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RXCRC</name>
							<description>Rx CRC register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TCRCR</name>
					<displayName>TCRCR</displayName>
					<description>TX CRC register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TXCRC</name>
							<description>Tx CRC register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSCR</name>
					<displayName>HSCR</displayName>
					<description>high speed control register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>HSRXEN</name>
							<description>High speed mode read enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSRXEN2</name>
							<description>High speed mode 2 read enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
