Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="SPI3">
			<name>SPI2</name>
			<baseAddress>0x40003800</baseAddress>
			<interrupt>
				<name>SPI2</name>
				<description>SPI2 global interrupt</description>
				<value>49</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>USBPD</name>
			<description>USBPD configuration</description>
			<groupName>USBPD</groupName>
			<baseAddress>0x40024400</baseAddress>
			<interrupt>
				<name>USBPDWakeUP</name>
				<description>USBPD_WKUP global interrupt</description>
				<value>55</value>
			</interrupt>
			<interrupt>
				<name>USBPD</name>
				<description>USBPD global interrupt</description>
				<value>54</value>
			</interrupt>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CONFIG</name>
					<displayName>CONFIG</displayName>
					<description>PD interrupt enable register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x10</size>
					<resetValue>0x0002</resetValue>
					<fields>
						<field>
							<name>PD_FILT_EN</name>
							<description>control PD pin input filter enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PD_ALL_CLR</name>
							<description>PD ITClear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC_SEL</name>
							<description>PD Commutation port</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PD_DMA_EN</name>
							<description>PD DMA Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PD_RST_EN</name>
							<description>PD RST Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WAKE_POLAR</name>
							<description>wakeup polarity</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC_TR</name>
							<description>TR conditioning of the CC LV waveform</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC_INC</name>
							<description>CC bias current adjustment bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_MULTI_0</name>
							<description>Continuously receive several bits of 0 indicator flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_PD_IO</name>
							<description>IO Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_RX_BIT</name>
							<description>bit interrupt Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_RX_BYTE</name>
							<description>Receive byte register</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_RX_ACT</name>
							<description>Receive complete register</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_RX_RESET</name>
							<description>Receive complete rst register</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_TX_END</name>
							<description>transfer complete register</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BMC_CLK_CNT</name>
					<displayName>BMC_CLK_CNT</displayName>
					<description>BMC sampling clock counter</description>
					<addressOffset>0x02</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>BMC_CLK_CNT</name>
							<description>R/T counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL</name>
					<displayName>CONTROL</displayName>
					<description>PD Send and receive enable register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>PD_TX_EN</name>
							<description>PD_TX_EN value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BMC_START</name>
							<description>BMC_START value</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_STATE</name>
							<description>PD receive status identification</description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA_FLAG</name>
							<description>DATA_FLAG value</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_BIT_BACK</name>
							<description>TX_BIT_BACK value</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BMC_BYTE_HI</name>
							<description>BMC_BYTE_HI value</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_SEL</name>
					<displayName>TX_SEL</displayName>
					<description>SOP port selection register</description>
					<addressOffset>0x5</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TX_SEL1</name>
							<description>TX_SEL1 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_SEL2</name>
							<description>TX_SEL2 value</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_SEL3</name>
							<description>TX_SEL3 value</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_SEL4</name>
							<description>TX_SEL4 value</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BMC_TX_SZ</name>
					<displayName>BMC_TX_SZ</displayName>
					<description>PD send length register</description>
					<addressOffset>0x6</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>BMC_TX_SZ</name>
							<description>BMC_TX_SZ value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA_BUF</name>
					<displayName>DATA_BUF</displayName>
					<description>DMA cache data register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>DATA_BUF</name>
							<description>DATA_BUF value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<displayName>STATUS</displayName>
					<description>PD interrupt flag register</description>
					<addressOffset>0x9</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>BMC_AUX</name>
							<description>BMC_AUX value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUF_ERR</name>
							<description>BUF_ERR value</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IF_RX_BIT</name>
							<description>IF_RX_BIT value</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IF_RX_BYTE</name>
							<description>IF_RX_BYTE value</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IF_RX_ACT</name>
							<description>IF_RX_ACT value</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IF_RX_RESET</name>
							<description>IF_RX_RESET value</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IF_TX_END</name>
							<description>IF_TX_END value</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BMC_BYTE_CNT</name>
					<displayName>BMC_BYTE_CNT</displayName>
					<description>Byte counter</description>
					<addressOffset>0xA</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>BMC_BYTE_CNT</name>
							<description>BMC_BYTE_CNT value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_CC1</name>
					<displayName>PORT_CC1</displayName>
					<description>CC1 port control register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x10</size>
					<resetValue>0x0003</resetValue>
					<fields>
						<field>
							<name>PA_CC1_AI</name>
							<description>PA_CC1_AI value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC1_PD</name>
							<description>port pull-down resistor enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1_PU</name>
							<description>CC1_PU value</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1_LVE</name>
							<description>CC1_LVE value</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1_CE</name>
							<description>CC1_CE value</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_CC2</name>
					<displayName>PORT_CC2</displayName>
					<description>CC2 port control register</description>
					<addressOffset>0xE</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PA_CC2_AI</name>
							<description>PA_CC2_AI value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2_PD</name>
							<description>port pull-down resistor enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2_PU</name>
							<description>CC2_PU value</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2_LVE</name>
							<description>CC2_LVE value</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2_CE</name>
							<description>CC2_CE value</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA</name>
					<displayName>DMA</displayName>
					<description>PD buffer start address register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>USBPD_DMA_ADDR</name>
							<description>USBPD_DMA_ADDR value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>21</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
