Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>TTCNT</name>
					<displayName>TTCNT</displayName>
					<description>CAN Time Trigger Count Value Register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIMCNT</name>
							<description>time-triggered count value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TERR_CNT</name>
					<displayName>TERR_CNT</displayName>
					<description>CAN offline recovery error counter</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TX_ERR_CNT</name>
							<description>Offline recovery error count values</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMI0R</name>
					<displayName>TXMI0R</displayName>
					<description>CAN TX mailbox identifier register</description>
					<addressOffset>0x180</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STID_EXID</name>
							<description>Standard identifier</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXID</name>
							<description>extended identifier</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier extension</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote transmission request</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXRQ</name>
							<description>Transmit mailbox request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDT0R</name>
					<displayName>TXMDT0R</displayName>
					<description>CAN mailbox data length control and time stamp register</description>
					<addressOffset>0x184</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIME</name>
							<description>Message time stamp</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TGT</name>
							<description>Transmit global time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DLC</name>
							<description>Data length code</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDL0R</name>
					<displayName>TXMDL0R</displayName>
					<description>CAN mailbox data low register</description>
					<addressOffset>0x188</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA3</name>
							<description>Data byte 3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA2</name>
							<description>Data byte 2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA1</name>
							<description>Data byte 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA0</name>
							<description>Data byte 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDH0R</name>
					<displayName>TXMDH0R</displayName>
					<description>CAN mailbox data high register</description>
					<addressOffset>0x18C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA7</name>
							<description>Data byte 7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA6</name>
							<description>Data byte 6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA5</name>
							<description>Data byte 5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA4</name>
							<description>Data byte 4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMI1R</name>
					<displayName>TXMI1R</displayName>
					<description>CAN TX mailbox identifier register</description>
					<addressOffset>0x190</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STID</name>
							<description>Standard identifier</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXID</name>
							<description>extended identifier</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier extension</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote transmission request</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXRQ</name>
							<description>Transmit mailbox request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDT1R</name>
					<displayName>TXMDT1R</displayName>
					<description>CAN mailbox data length control and time stamp register</description>
					<addressOffset>0x194</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIME</name>
							<description>Message time stamp</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TGT</name>
							<description>Transmit global time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DLC</name>
							<description>Data length code</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDL1R</name>
					<displayName>TXMDL1R</displayName>
					<description>CAN mailbox data low register</description>
					<addressOffset>0x198</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA3</name>
							<description>Data byte 3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA2</name>
							<description>Data byte 2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA1</name>
							<description>Data byte 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA0</name>
							<description>Data byte 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDH1R</name>
					<displayName>TXMDH1R</displayName>
					<description>CAN mailbox data high register</description>
					<addressOffset>0x19C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA7</name>
							<description>Data byte 7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA6</name>
							<description>Data byte 6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA5</name>
							<description>Data byte 5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA4</name>
							<description>Data byte 4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMI2R</name>
					<displayName>TXMI2R</displayName>
					<description>CAN TX mailbox identifier register</description>
					<addressOffset>0x1A0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STID</name>
							<description>Standard identifier</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXID</name>
							<description>extended identifier</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier extension</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote transmission request</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXRQ</name>
							<description>Transmit mailbox request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDT2R</name>
					<displayName>TXMDT2R</displayName>
					<description>CAN mailbox data length control and time stamp register</description>
					<addressOffset>0x1A4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIME</name>
							<description>Message time stamp</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TGT</name>
							<description>Transmit global time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DLC</name>
							<description>Data length code</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDL2R</name>
					<displayName>TXMDL2R</displayName>
					<description>CAN mailbox data low register</description>
					<addressOffset>0x1A8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA3</name>
							<description>Data byte 3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA2</name>
							<description>Data byte 2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA1</name>
							<description>Data byte 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA0</name>
							<description>Data byte 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMDH2R</name>
					<displayName>TXMDH2R</displayName>
					<description>CAN mailbox data high register</description>
					<addressOffset>0x1AC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA7</name>
							<description>Data byte 7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA6</name>
							<description>Data byte 6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA5</name>
							<description>Data byte 5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA4</name>
							<description>Data byte 4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMI0R</name>
					<displayName>RXMI0R</displayName>
					<description>CAN receive FIFO mailbox identifier register</description>
					<addressOffset>0x1B0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STID</name>
							<description>Standard identifier</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXID</name>
							<description>extended identifier</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier extension</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote transmission request</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDT0R</name>
					<displayName>RXMDT0R</displayName>
					<description>CAN receive FIFO mailbox data length control and time stamp register</description>
					<addressOffset>0x1B4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIME</name>
							<description>Message time stamp</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FMI</name>
							<description>Filter match index</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RES</name>
							<description>RES bit of the received frame</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESI</name>
							<description>ESI bit of the received frame</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BRS</name>
							<description>BRS bit of the received frame</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DLC</name>
							<description>Data length code</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDL0R</name>
					<displayName>RXMDL0R</displayName>
					<description>CAN receive FIFO mailbox data low register</description>
					<addressOffset>0x1B8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA3</name>
							<description>Data Byte 3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA2</name>
							<description>Data Byte 2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA1</name>
							<description>Data Byte 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA0</name>
							<description>Data Byte 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDH0R</name>
					<displayName>RXMDH0R</displayName>
					<description>CAN receive FIFO mailbox data high register</description>
					<addressOffset>0x1BC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA7</name>
							<description>DATA7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA6</name>
							<description>DATA6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA5</name>
							<description>DATA5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA4</name>
							<description>DATA4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMI1R</name>
					<displayName>RXMI1R</displayName>
					<description>CAN receive FIFO mailbox identifier register</description>
					<addressOffset>0x1C0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STID</name>
							<description>Standard identifier</description>
							<bitOffset>21</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXID</name>
							<description>extended identifier</description>
							<bitOffset>3</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier extension</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote transmission request</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDT1R</name>
					<displayName>RXMDT1R</displayName>
					<description>CAN receive FIFO mailbox data length control and time stamp register</description>
					<addressOffset>0x1C4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIME</name>
							<description>Message time stamp</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FMI</name>
							<description>Filter match index</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RES</name>
							<description>RES bit of the received frame</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESI</name>
							<description>ESI bit of the received frame</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BRS</name>
							<description>BRS bit of the received frame</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DLC</name>
							<description>Data length code</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMDL1R</name>
					<displayName>RXMDL1R</displayName>
					<description>CAN receive FIFO mailbox data low register</description>
					<addressOffset>0x1C8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA3</name>
							<description>Data Byte 3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA2</name>
							<description>Data Byte 2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA1</name>
							<description>Data Byte 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA0</name>
							<description>Data Byte 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
