Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RNG</name>
			<description>Random number generator</description>
			<groupName>RNG</groupName>
			<baseAddress>0x40023C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RNG</name>
				<description>RNG interrupt</description>
				<value>146</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IE</name>
							<description>Interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNGEN</name>
							<description>Random number generator enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>status register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SEIS</name>
							<description>Seed error interrupt status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEIS</name>
							<description>Clock error interrupt status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SECS</name>
							<description>Seed error current status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CECS</name>
							<description>Clock error current status</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DRDY</name>
							<description>Data ready</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>data register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RNDATA</name>
							<description>Random data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SERDES</name>
			<description>Serial-parallel interconversion controller and transceiver</description>
			<groupName>SERDES</groupName>
			<baseAddress>0x40027C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SERDES</name>
				<description>SERDES global interrupt</description>
				<value>83</value>
			</interrupt>
			<registers>
				<register>
					<name>SERDES1_CTRL</name>
					<displayName>SERDES1_CTRL</displayName>
					<description>SERDESx Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00041207</resetValue>
					<fields>
						<field>
							<name>ALIGN_EN</name>
							<description>A ALIGN signal is inserted at the time of transmission, and it is highly effective to solve the frequency offset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CONT_EN</name>
							<description>Replace the SYNC at idle with CONT and scrambling data to reduce EMI</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_PWR_UP</name>
							<description>Power-on enable bit of transmit module</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_PWR_UP</name>
							<description>Receiver module power-up enable bit</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA_EN</name>
							<description>DMA enables</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_EN</name>
							<description>Send Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_EN</name>
							<description>Receiver Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_POLARITY</name>
							<description>RXN/RXP signal exchange</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INT_BUSY_EN</name>
							<description>The SERDES transmission is complete, and the interruption flag is not cleared</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESET_PHY</name>
							<description>SERDES Physical Layer Software Reset Control Bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESET_LINK</name>
							<description>SERDES Link Layer Software Reset Control Bits</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CLR_ALL</name>
							<description>Clear the SERDES interrupt flag and FIFO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_INT_EN</name>
					<displayName>SERDES1_INT_EN</displayName>
					<description>SERDESx interrupt enable register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMINIT_IE</name>
							<description>COMIT RECEIVE INTERRUPT ENABLES</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FIFO_OV_IE</name>
							<description>FIFO overflow interrupt enabled</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RECV_DONE_IE</name>
							<description>Receive Completion Interrupt Enables</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRAN_DONE_IE_RECV_ERR_IE</name>
							<description>Transmission Mode: Interrupt Enabled for Transmission Completion; Receive Mode: Receive CRC Error Interrupt Enabled</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PHYRDY_IE</name>
							<description>PHYS-LAYER READY INTERRUPT ENABLES</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_INT_FS</name>
					<displayName>SERDES1_INT_FS</displayName>
					<description>SERDESx Interrupt Flag/Status Register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TX_SEQ_NUM</name>
							<description>LINK_INIT automatically clears when it is valid</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RX_SEQ_NUM</name>
							<description>In the receive mode, the received COMINT is automatically cleared</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>R_FIFO_RDY</name>
							<description>SERDES receives FIFO data readiness status</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_FREE</name>
							<description>The SERDES link layer sends the idle status bits</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PLL_LOCK</name>
							<description>The PLL locks the status bit</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RECV_CRC_OK</name>
							<description>The receive dataframe checks the status bit, detects it after RECV_DONE interrupt, and updates it after the packet is received</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RX_SEQ_MATCH</name>
							<description>Receive SEQ_NUM match status bits</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PHYRDY</name>
							<description>The physical layer READY status bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMINIT_IF</name>
							<description>COMIT receives the interrupt flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIFO_OV_IF</name>
							<description>FIFO overflows the interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RECV_DONE_IF</name>
							<description>Receive the Interrupt Completion flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRAN_DONE_IF_RECV_ERR_IF</name>
							<description>Sending Mode: The signal of the interrupt is completed. Receive Mode: Receives the CRC error interrupt flag.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PHYRDY_IF</name>
							<description>The physical layer READY interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_RTX_CTRL</name>
					<displayName>SERDES1_RTX_CTRL</displayName>
					<description>SERDESx Transceiver Controller</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BUF_MODE</name>
							<description>Double-buffered control bit</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_VLD</name>
							<description>The sent packet is valid, zeroed by the software, and the bit is returned and synchronized with the PHY_CLK</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LINK_INIT</name>
							<description>This bit is 1 and sends a LINK initialization packet</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SERDES_TX_LEN</name>
							<description>Number of data bytes sent, the lower 2 bits are fixed at 0 (4-byte aligned)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_RX_LEN0</name>
					<displayName>SERDES1_RX_LEN0</displayName>
					<description>SERDESx Receive Length 0 Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_RX_LEN0</name>
							<description>The packet length of the last received data, with the lowest 2 digits fixed at 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_DATA0</name>
					<displayName>SERDES1_DATA0</displayName>
					<description>SERDESx Data 0 Buffer Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DATA0</name>
							<description>SERDES data buffer 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_DMA0</name>
					<displayName>SERDES1_DMA0</displayName>
					<description>Start address register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DMA0</name>
							<description>Buffer 0 start address, in receive mode, the software needs to align the lower 4 fixed bits 0 (16 bytes), and in send mode, it does not need to align 16 bytes</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_RX_LEN1</name>
					<displayName>SERDES1_RX_LEN1</displayName>
					<description>SERDESx Receive Length 1 Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_RX_LEN1</name>
							<description>The packet length of the last received data, with the lowest 2 digits fixed at 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_DATA1</name>
					<displayName>SERDES1_DATA1</displayName>
					<description>SERDESx Data 1 Buffer Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DATA1</name>
							<description>SERDES data buffer 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES1_DMA1</name>
					<displayName>SERDES1_DMA1</displayName>
					<description>Start address register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DMA1</name>
							<description>Buffer 0 start address, in receive mode, the software needs to align the lower 4 fixed bits 0 (16 bytes), and in send mode, it does not need to align 16 bytes</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_CTRL</name>
					<displayName>SERDES2_CTRL</displayName>
					<description>SERDESx Control Register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00041207</resetValue>
					<fields>
						<field>
							<name>ALIGN_EN</name>
							<description>A ALIGN signal is inserted at the time of transmission, and it is highly effective to solve the frequency offset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CONT_EN</name>
							<description>Replace the SYNC at idle with CONT and scrambling data to reduce EMI</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PHY_PWR_UP</name>
							<description>Enable bits on the physical layer</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_PWR_UP</name>
							<description>Power-on enable bit of transmit module</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_PWR_UP</name>
							<description>Receiver module power-up enable bit</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL_FACTOR</name>
							<description>PLL Clock Control Coefficient</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DMA_EN</name>
							<description>DMA enables</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_EN</name>
							<description>Send Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_EN</name>
							<description>Receiver Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_POLARITY</name>
							<description>RXN/RXP signal exchange</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INT_BUSY_EN</name>
							<description>The SERDES transmission is complete, and the interruption flag is not cleared</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESET_PHY</name>
							<description>SERDES Physical Layer Software Reset Control Bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESET_LINK</name>
							<description>SERDES Link Layer Software Reset Control Bits</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CLR_ALL</name>
							<description>Clear the SERDES interrupt flag and FIFO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_INT_EN</name>
					<displayName>SERDES2_INT_EN</displayName>
					<description>SERDESx interrupt enable register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMINIT_IE</name>
							<description>COMIT RECEIVE INTERRUPT ENABLES</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FIFO_OV_IE</name>
							<description>FIFO overflow interrupt enabled</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RECV_DONE_IE</name>
							<description>Receive Completion Interrupt Enables</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRAN_DONE_IE_RECV_ERR_IE</name>
							<description>Transmission Mode: Interrupt Enabled for Transmission Completion; Receive Mode: Receive CRC Error Interrupt Enabled</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PHYRDY_IE</name>
							<description>PHYS-LAYER READY INTERRUPT ENABLES</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_INT_FS</name>
					<displayName>SERDES1_INT_FS</displayName>
					<description>SERDESx Interrupt Flag/Status Register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TX_SEQ_NUM</name>
							<description>LINK_INIT automatically clears when it is valid</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RX_SEQ_NUM</name>
							<description>In the receive mode, the received COMINT is automatically cleared</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>R_FIFO_RDY</name>
							<description>SERDES receives FIFO data readiness status</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_FREE</name>
							<description>The SERDES link layer sends the idle status bits</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PLL_LOCK</name>
							<description>The PLL locks the status bit</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RECV_CRC_OK</name>
							<description>The receive dataframe checks the status bit, detects it after RECV_DONE interrupt, and updates it after the packet is received</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RX_SEQ_MATCH</name>
							<description>Receive SEQ_NUM match status bits</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PHYRDY</name>
							<description>The physical layer READY status bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMINIT_IF</name>
							<description>COMIT receives the interrupt flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIFO_OV_IF</name>
							<description>FIFO overflows the interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RECV_DONE_IF</name>
							<description>Receive the Interrupt Completion flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRAN_DONE_IF_RECV_ERR_IF</name>
							<description>Sending Mode: The signal of the interrupt is completed. Receive Mode: Receives the CRC error interrupt flag.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PHYRDY_IF</name>
							<description>The physical layer READY interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
