Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>UEP4_RX_CHAIN_NUMP</name>
					<description>Number of NUMPs has been received by Endpoint 4</description>
					<addressOffset>0x139</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TX_CHAIN_NUMP</name>
							<description>The number of DPP packets that has received</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP4_RX_DMA_OFS</name>
					<description>DMA offset length for Endpoint 4</description>
					<addressOffset>0x13A</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHAIN_DMA_OFS</name>
							<description>The offset address of the DPP in that CHAIN</description>
							<bitRange>[15:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP4_RX_DMA</name>
					<description>DMA start address for Endpoint 4</description>
					<addressOffset>0x13C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHAIN_RX_DMA</name>
							<description>Normal mode:The DMA start address of the CHAIN to receive data. FIFO mode:16~23 bits of the FIFO start address in SRAM;The FIFO end address is 16~23 bits of the mapped address in SRAM.</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CFG</name>
					<description>Endpoint 5 Configuration Register</description>
					<addressOffset>0x150</addressOffset>
					<size>0x8</size>
					<resetValue>0x86</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_AUTO</name>
							<description>CHAIN automatically switches modes, and this mode is recommended</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_FIFO_MODE</name>
							<description>If the bit is 1, the current endpoint uses FIFO mode, and the start and end addresses of the FIFO should be configured before the bit is 1.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_FIFO_CFG</name>
							<description>Access offset address 0xC~0xF, and the operation object</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_TOUT_MODE</name>
							<description>This bit is 1, and when a continuous burst packet is received, PP=1 and not a short packet is not received, and DPH is not received after the timeout, resulting in TOUT_IF interrupt</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_EOB_MODE</name>
							<description>This bit is 1, and when a short packet or DP(PP=0) is received, clearing all CHAIN_EN will result in an NRDY response to the subsequent DPH; Software reconfiguration required.</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_AUTO</name>
							<description>ERDY automatic mode, the hardware will send ERDY, no software control required; It is recommended that the synchronization endpoint zero out this bit.</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_SEQ_AUTO</name>
							<description>1: It is forbidden to write R16_EPn_ST-&gt;EP_SEQ_NUM software; 0: allows the software to write R16_EPn_ST-&gt;EP_SEQ_NUM.</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ISO_MODE</name>
							<description>A value of 1 indicates that the current endpoint is a synchronous endpoint</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CR</name>
					<description>Endpoint 5 control register</description>
					<addressOffset>0x151</addressOffset>
					<size>0x8</size>
					<resetValue>0x10</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_HALT</name>
							<description>Endpoint Stop, High Validity, Endpoint Stop Answering STALL to DPH.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CLR</name>
							<description>Write 1 clears all configuration values and status of the endpoint, except for UEP_CFG.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_CLR</name>
							<description>Write 1 clears all CHAIN configuration values and statuses</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_NUMP</name>
							<description>The nump field of ERDY-TP is sent by the hardware, and the value is generally set to the number of supported bursts. For example, if you support 16 bursts, the value of this field is 16.</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_SEQ</name>
					<description>Endpoint 5 Serial Number Register</description>
					<addressOffset>0x152</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_SEQ_NUM</name>
							<description>The current serial number of the endpoint, writable in non-SEQ_AUTO mode, read-only in SEQ_AUTO mode</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_ST</name>
					<description>Endpoint 5 status register</description>
					<addressOffset>0x153</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_INT_FLAG</name>
							<description>The current break flag for the endpoint, the bit is read-only, and all CHAIN_IF are 0 if the bit is 0, otherwise it is 1.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_FC_ST</name>
							<description>The endpoint is in the current throttling state, and write 1 is cleared to zero.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_REQ</name>
							<description>Indicates that the ERDY is currently being sent; Writing 1 to that bit will send ERDY, which is used in non-ERDY_AUTO mode.</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_RES</name>
							<description>CHAIN response state, corresponding to 4 separate CHAINS</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_ER_RX_CHAIN_EN</name>
							<description>The CHAIN enabled state, which corresponds to 4 independent CHAINS.</description>
							<bitRange>[3:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CHAIN_CR</name>
					<description>Endpoint 5 CHAIN control register</description>
					<addressOffset>0x154</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CUR_USE</name>
							<description>The CHAIN serial number currently in use</description>
							<bitRange>[7:6]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_CUR_CFG</name>
							<description>The chain serial number of the current configuration.</description>
							<bitRange>[5:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_FORCE_RET</name>
							<description>This bit effectively forces the return of the selected CHAIN state machine configuration</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_RET_SEL</name>
							<description>When the FORCE_RET is valid, this bit indicates the returned CHAIN status and configuration</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CHAIN_ST</name>
					<description>Endpoint 5 CHAIN state register</description>
					<addressOffset>0x155</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_EN</name>
							<description>The currently used CHAIN enables the automatic hardware setting of 1 after the UEP_CHAIN_NUMP register is configured, and the CHAIN is automatically cleared to zero after the transmission is completed</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_IF</name>
							<description>This bit is only written, and 1 is written to release the current CHAIN_IF</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_LPF_FLAG</name>
							<description>Only the synchronous downhaul endpoint is used to currently receive the LPF status in the DPH.</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_NUMP_EMPTY</name>
							<description>IF THE NUMP IN THE CHAIN IS 0, THE POSITION IS 1</description>
							<bitRange>[3:3]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_DPH_PP</name>
							<description>The status of the PP bits in the currently received DPH</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_NO</name>
							<description>The serial number of the CHAIN that is currently interrupting</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CHAIN_LEN</name>
					<description>Endpoint 5 CHAIN sends the last packet length</description>
					<addressOffset>0x156</addressOffset>
					<size>0x10</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_RX_LEN</name>
							<description>The length of the currently completed CHAIN to the last packet.</description>
							<bitRange>[10:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CHAIN_MAX_NUMP</name>
					<description>Number of NUMPs that Endpoint 5 can receive</description>
					<addressOffset>0x158</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RX_CHAIN_MAX_NUMP</name>
							<description>The number of DPP packets that can be received by the CHAIN</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CHAIN_NUMP</name>
					<description>Number of NUMPs has been received by Endpoint 5</description>
					<addressOffset>0x159</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TX_CHAIN_NUMP</name>
							<description>The number of DPP packets that has received</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_DMA_OFS</name>
					<description>DMA offset length for Endpoint 5</description>
					<addressOffset>0x15A</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHAIN_DMA_OFS</name>
							<description>The offset address of the DPP in that CHAIN</description>
							<bitRange>[15:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_DMA</name>
					<description>DMA start address for Endpoint 5</description>
					<addressOffset>0x15C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHAIN_RX_DMA</name>
							<description>Normal mode:The DMA start address of the CHAIN to receive data. FIFO mode:16~23 bits of the FIFO start address in SRAM;The FIFO end address is 16~23 bits of the mapped address in SRAM.</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CFG</name>
					<description>Endpoint 6 Configuration Register</description>
					<addressOffset>0x170</addressOffset>
					<size>0x8</size>
					<resetValue>0x86</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_AUTO</name>
							<description>CHAIN automatically switches modes, and this mode is recommended</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_FIFO_MODE</name>
							<description>If the bit is 1, the current endpoint uses FIFO mode, and the start and end addresses of the FIFO should be configured before the bit is 1.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_FIFO_CFG</name>
							<description>Access offset address 0xC~0xF, and the operation object</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_TOUT_MODE</name>
							<description>This bit is 1, and when a continuous burst packet is received, PP=1 and not a short packet is not received, and DPH is not received after the timeout, resulting in TOUT_IF interrupt</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_EOB_MODE</name>
							<description>This bit is 1, and when a short packet or DP(PP=0) is received, clearing all CHAIN_EN will result in an NRDY response to the subsequent DPH; Software reconfiguration required.</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_AUTO</name>
							<description>ERDY automatic mode, the hardware will send ERDY, no software control required; It is recommended that the synchronization endpoint zero out this bit.</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_SEQ_AUTO</name>
							<description>1: It is forbidden to write R16_EPn_ST-&gt;EP_SEQ_NUM software; 0: allows the software to write R16_EPn_ST-&gt;EP_SEQ_NUM.</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ISO_MODE</name>
							<description>A value of 1 indicates that the current endpoint is a synchronous endpoint</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CR</name>
					<description>Endpoint 6 control register</description>
					<addressOffset>0x171</addressOffset>
					<size>0x8</size>
					<resetValue>0x10</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_HALT</name>
							<description>Endpoint Stop, High Validity, Endpoint Stop Answering STALL to DPH.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CLR</name>
							<description>Write 1 clears all configuration values and status of the endpoint, except for UEP_CFG.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_CLR</name>
							<description>Write 1 clears all CHAIN configuration values and statuses</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_NUMP</name>
							<description>The nump field of ERDY-TP is sent by the hardware, and the value is generally set to the number of supported bursts. For example, if you support 16 bursts, the value of this field is 16.</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_SEQ</name>
					<description>Endpoint 6 Serial Number Register</description>
					<addressOffset>0x172</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_SEQ_NUM</name>
							<description>The current serial number of the endpoint, writable in non-SEQ_AUTO mode, read-only in SEQ_AUTO mode</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_ST</name>
					<description>Endpoint 6 status register</description>
					<addressOffset>0x173</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_INT_FLAG</name>
							<description>The current break flag for the endpoint, the bit is read-only, and all CHAIN_IF are 0 if the bit is 0, otherwise it is 1.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_FC_ST</name>
							<description>The endpoint is in the current throttling state, and write 1 is cleared to zero.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_REQ</name>
							<description>Indicates that the ERDY is currently being sent; Writing 1 to that bit will send ERDY, which is used in non-ERDY_AUTO mode.</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_RES</name>
							<description>CHAIN response state, corresponding to 4 separate CHAINS</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_ER_RX_CHAIN_EN</name>
							<description>The CHAIN enabled state, which corresponds to 4 independent CHAINS.</description>
							<bitRange>[3:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CHAIN_CR</name>
					<description>Endpoint 6 CHAIN control register</description>
					<addressOffset>0x174</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CUR_USE</name>
							<description>The CHAIN serial number currently in use</description>
							<bitRange>[7:6]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_CUR_CFG</name>
							<description>The chain serial number of the current configuration.</description>
							<bitRange>[5:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_FORCE_RET</name>
							<description>This bit effectively forces the return of the selected CHAIN state machine configuration</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_RET_SEL</name>
							<description>When the FORCE_RET is valid, this bit indicates the returned CHAIN status and configuration</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CHAIN_ST</name>
					<description>Endpoint 6 CHAIN state register</description>
					<addressOffset>0x175</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_EN</name>
							<description>The currently used CHAIN enables the automatic hardware setting of 1 after the UEP_CHAIN_NUMP register is configured, and the CHAIN is automatically cleared to zero after the transmission is completed</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_IF</name>
							<description>This bit is only written, and 1 is written to release the current CHAIN_IF</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_LPF_FLAG</name>
							<description>Only the synchronous downhaul endpoint is used to currently receive the LPF status in the DPH.</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_NUMP_EMPTY</name>
							<description>IF THE NUMP IN THE CHAIN IS 0, THE POSITION IS 1</description>
							<bitRange>[3:3]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_DPH_PP</name>
							<description>The status of the PP bits in the currently received DPH</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_NO</name>
							<description>The serial number of the CHAIN that is currently interrupting</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CHAIN_LEN</name>
					<description>Endpoint 6 CHAIN sends the last packet length</description>
					<addressOffset>0x176</addressOffset>
					<size>0x10</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_RX_LEN</name>
							<description>The length of the currently completed CHAIN to the last packet.</description>
							<bitRange>[10:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CHAIN_MAX_NUMP</name>
					<description>Number of NUMPs that Endpoint 6 can receive</description>
					<addressOffset>0x178</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RX_CHAIN_MAX_NUMP</name>
							<description>The number of DPP packets that can be received by the CHAIN</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CHAIN_NUMP</name>
					<description>Number of NUMPs has been received by Endpoint 6</description>
					<addressOffset>0x179</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TX_CHAIN_NUMP</name>
							<description>The number of DPP packets that has received</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
