Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ECDC</name>
			<description>ECDC register</description>
			<groupName>ECDC</groupName>
			<baseAddress>0x40016C00</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ECDC</name>
				<description>ECDC global Interrupt interrupt</description>
				<value>121</value>
			</interrupt>
			<registers>
				<register>
					<name>R32_ECEC_CTRL</name>
					<description>ECED AES/SM4 register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000020</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEYEX_EN</name>
							<description>enable key expansion</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_NORMAL_EN</name>
							<description>Enable the encryption and decryption to work in the normal encryption and decryption mode</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_MODE_SEL</name>
							<description>ECDC mode select</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_CLKDIV_MASK</name>
							<description>Clock divide factor</description>
							<bitRange>[6:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_WRSRAM_EN</name>
							<description>module dma enable</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_ALGRM_MOD</name>
							<description>Encryption and decryption algorithm mode selection</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_CIPHER_MOD</name>
							<description>Block cipher mode selection</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_KLEN_MASK</name>
							<description>Key length setting</description>
							<bitRange>[11:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_DAT_MOD</name>
							<description>source data and result data is bit endian</description>
							<bitRange>[13:13]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_ECDC_IE_SINGLE</name>
							<description>Single encryption and decryption completion interrupt enable</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_IE_WRSRAM</name>
							<description>Memory to memory encryption and decryption completion interrupt enable</description>
							<bitRange>[18:18]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_ECDC_CLOCK_SELECT</name>
							<description>ECED AES/SM4 clock selection</description>
							<bitRange>[24:24]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ECDC_AES_SM4_CLOCK_EN</name>
							<description>ECED AES/SM4 clock enabled</description>
							<bitRange>[25:25]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_INT_FG</name>
					<description>Interupt flag register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_IF_SINGLE</name>
							<description>Single encryption and decryption completion interrupt flag</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RB_ECDC_IF_WRSRAM</name>
							<description>Memory to memory encryption and decryption completion interrupt flag</description>
							<bitRange>[18:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_255T224</name>
					<description>User key 224-255 register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_255T224</name>
							<description>User key 224-255 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_223T192</name>
					<description>User key 192-223 register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_223T192</name>
							<description>User key 192-223 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_191T160</name>
					<description>User key 160-191 register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_191T160</name>
							<description>User key 160-191 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_159T128</name>
					<description>User key 128-159 register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_159T128</name>
							<description>User key 128-159 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_127T96</name>
					<description>User key 96-127 register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_127T96</name>
							<description>User key 96-127 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_95T64</name>
					<description>User key 64-95 register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_95T64</name>
							<description>User key 64-95 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_63T32</name>
					<description>User key 32-63 register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_63T32</name>
							<description>User key 32-63 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_KEY_31T0</name>
					<description>User key 0-31 register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_KEY_31T0</name>
							<description>User key 0-31 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_IV_127T96</name>
					<description>CTR mode count 96-127 register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_IV_127T96</name>
							<description>CTR mode count 96-127 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_IV_95T64</name>
					<description>CTR mode count 64-95 register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_IV_95T64</name>
							<description>CTR mode count 64-95 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_IV_63T32</name>
					<description>CTR mode count 32-63 register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_IV_63T32</name>
							<description>CTR mode count 32-63 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_IV_31T0</name>
					<description>CTR mode count 0-31 register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_IV_31T0</name>
							<description>CTR mode count 0-31 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SGSD_127T96</name>
					<description>Single encryption and decryption of original data 96-127 register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGSD_127T96</name>
							<description>Single encryption and decryption of original data 96-127 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SGSD_95T64</name>
					<description>Single encryption and decryption of original data 64-95 register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGSD_95T64</name>
							<description>Single encryption and decryption of original data 64-95 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SGSD_63T32</name>
					<description>Single encryption and decryption of original data 32-63 register</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGSD_63T32</name>
							<description>Single encryption and decryption of original data 32-63 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SGSD_31T0</name>
					<description>Single encryption and decryption of original data 0-31 register</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGSD_31T0</name>
							<description>Single encryption and decryption of original data 0-31 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SGRT_127T96</name>
					<description>Single encryption and decryption result 96-127 register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGRT_127T96</name>
							<description>Single encryption and decryption result 96-127 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SGRT_95T64</name>
					<description>Single encryption and decryption result 64-95 register</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGRT_95T64</name>
							<description>Single encryption and decryption result 64-95 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SGRT_63T32</name>
					<description>Single encryption and decryption result 0-31 register</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGRT_63T32</name>
							<description>Single encryption and decryption result 0-31 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RB_ECDC_SGRT_31T0</name>
					<description>Single encryption and decryption result 0-31 register</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SGRT_31T0</name>
							<description>Single encryption and decryption result 0-31 register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SRC_ADDR</name>
					<description>encryption and decryption sram start address register</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SRC_ADDR</name>
							<description>encryption and decryption sram start address register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_DST_ADDR</name>
					<description>encryption and decryption sram destination address register</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_DST_ADDR</name>
							<description>encryption and decryption sram destination address register</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ECDC_SRAM_LEN</name>
					<description>encryption and decryption sram size register</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_ECDC_SRAM_LEN</name>
							<description>encryption and decryption sram size register</description>
							<bitRange>[12:0]</bitRange>
						</field>
					</fields>
				</register>
