Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>I3C</name>
			<description>Improved inter-integrated circuit</description>
			<groupName>I3C</groupName>
			<baseAddress>0x40014400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I3C_EV</name>
				<description>I3C event interrupt</description>
				<value>118</value>
			</interrupt>
			<interrupt>
				<name>I3C_ER</name>
				<description>I3C error interrupt</description>
				<value>119</value>
			</interrupt>
			<interrupt>
				<name>I3CWakeUP</name>
				<description>I3C wakeup interrupt</description>
				<value>142</value>
			</interrupt>
			<registers>
				<register>
					<name>I3C_CTLR</name>
					<displayName>I3C_CTLR</displayName>
					<description>I3C control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCNT</name>
							<description>count of data to transfer during a read or write message, in bytes (whatever I3C is acting as master/slave) Linear encoding up to 64 Kbytes -1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RNW</name>
							<description>read / non-write message (when I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ADD</name>
							<description>7-bit I3C dynamic / I2C static slave address (when I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>7</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MTYPE</name>
							<description>message type</description>
							<bitOffset>27</bitOffset>
							<bitWidth>4</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MEND</name>
							<description>message end type (when the I3C is acting as master)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_CR_ALTERNATE</name>
					<displayName>I3C_CR_ALTERNATE</displayName>
					<description>I3C message control register alternate</description>
					<alternateRegister>I3C_CTLR</alternateRegister>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCNT</name>
							<description>count of data to transfer during a read or write message, in bytes (when I3C is acting as master) Linear encoding up to 64 Kbytes -1....</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CCC</name>
							<description>8-bit CCC code (when I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MTYPE</name>
							<description>message type (when I3C is acting as master)</description>
							<bitOffset>27</bitOffset>
							<bitWidth>4</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MEND</name>
							<description>message end type (when I3C is acting as master)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_CFGR</name>
					<displayName>I3C_CFGR</displayName>
					<description>I3C configuration register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>I3C enable (whatever I3C is acting as master/slave)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRINIT</name>
							<description>initial master/slave role</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NOARBH</name>
							<description>no arbitrable header after a START (when I3C is acting as a master)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTPTRN</name>
							<description>HDR reset pattern enable (when I3C is acting as a master)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXITPTRN</name>
							<description>HDR Exit Pattern enable (when I3C is acting as a master)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HJACK</name>
							<description>Hot Join request acknowledge (when I3C is acting as a master)</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXDMAEN</name>
							<description>RX-FIFO DMA request enable (whatever I3C is acting as master/slave)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFLUSH</name>
							<description>RX-FIFO flush (whatever I3C is acting as master/slave)This bit can only be written.</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXTHRES</name>
							<description>RX-FIFO threshold (whatever I3C is acting as master/slave)</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXDMAEN</name>
							<description>TX-FIFO DMA request enable (whatever I3C is acting as master/slave)</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFLUSH</name>
							<description>TX-FIFO flush (whatever I3C is acting as master/slave)</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXTHRES</name>
							<description>TX-FIFO threshold (whatever I3C is acting as master/slave)</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDMAEN</name>
							<description>S-FIFO DMA request enable (when I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SFLUSH</name>
							<description>S-FIFO flush (when I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RMODE</name>
							<description>S-FIFO enable / status receive mode (when I3C is acting as master)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TMODE</name>
							<description>transmit mode (when I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CDMAEN</name>
							<description>C-FIFO DMA request enable (when I3C is acting as master)</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>B_0x0</name>
									<description>DMA mode is disabled for C-FIFO</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>B_0x1</name>
									<description>DMA mode is enabled for C-FIFO</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFLUSH</name>
							<description>C-FIFO flush (when I3C is acting as master)</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TSFSET</name>
							<description>frame transfer set (a.k.a. software trigger) (when I3C is acting as master)</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_RDR</name>
					<displayName>I3C_RDR</displayName>
					<description>I3C receive data byte register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RDB0</name>
							<description>8-bit received data on I3C bus.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_RDWR</name>
					<displayName>I3C_RDWR</displayName>
					<description>I3C receive data word register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RDB0</name>
							<description>8-bit received data (earliest byte on I3C bus).</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDB1</name>
							<description>8-bit received data (next byte after RDB0 on I3C bus).</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDB2</name>
							<description>8-bit received data (next byte after RDB1 on I3C bus).</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDB3</name>
							<description>8-bit received data (latest byte on I3C bus).</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_TDR</name>
					<displayName>I3C_TDR</displayName>
					<description>I3C transmit data byte register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TDB0</name>
							<description>8-bit data to transmit on I3C bus.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_TDWR</name>
					<displayName>I3C_TDWR</displayName>
					<description>I3C transmit data word register</description>
					<addressOffset>0x1c</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TDB0</name>
							<description>8-bit transmit data (earliest byte on I3C bus)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TDB1</name>
							<description>8-bit transmit data (next byte after TDB0[7:0] on I3C bus).</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TDB2</name>
							<description>8-bit transmit data (next byte after TDB1[7:0] on I3C bus).</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TDB3</name>
							<description>8-bit transmit data (latest byte on I3C bus).</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_IBIDR</name>
					<displayName>I3C_IBIDR</displayName>
					<description>I3C IBI payload data register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IBIDB0</name>
							<description>8-bit IBI payload data (earliest byte on I3C bus, i.e. MDB[7:0] mandatory data byte).</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIDB1</name>
							<description>8-bit IBI payload data (next byte on I3C bus after IBIDB0[7:0]).</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIDB2</name>
							<description>8-bit IBI payload data (next byte on I3C bus after IBIDB1[7:0]).</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIDB3</name>
							<description>8-bit IBI payload data (latest byte on I3C bus).</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_TGTTDR</name>
					<displayName>I3C_TGTTDR</displayName>
					<description>I3C slave transmit configuration register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TGTTDCNT</name>
							<description>transmit data counter, in bytes (when I3C is configured as slave)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRELOAD</name>
							<description>preload of the TX-FIFO (when I3C is configured as slave)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_RESET</name>
					<displayName>I3C_RESET</displayName>
					<description>I3C reset register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<resetValue>0x03000000</resetValue>
					<fields>
						<field>
							<name>HST_SIE_RST</name>
							<description>Reset Register of the Master</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TGT_SIE_RST</name>
							<description>Reset Register of the slave</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_STATR</name>
					<displayName>I3C_STATR</displayName>
					<description>I3C status register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XDCNT</name>
							<description>data counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ABT</name>
							<description>a private read message is completed/aborted prematurely by the slave (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DIR</name>
							<description>message direction(whatever I3C is acting as master/slave)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MID</name>
							<description>message identifier/counter of a given frame (when the I3C is acting as master)</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_STATER</name>
					<displayName>I3C_STATER</displayName>
					<description>I3C status error register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CODERR</name>
							<description>protocol error code/type</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PERR</name>
							<description>protocol error</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STALL</name>
							<description>SCL stall error (when the I3C is acting as slave)</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DOVR</name>
							<description>RX-FIFO overrun or TX-FIFO underrun</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COVR</name>
							<description>C-FIFO underrun or S-FIFO overrun (when the I3C is acting as master)</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ANACK</name>
							<description>address not acknowledged (when the I3C is configured as master)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DNACK</name>
							<description>data not acknowledged (when the I3C is acting as master)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DERR</name>
							<description>data error (when the I3C is acting as master)</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_RMR</name>
					<displayName>I3C_RMR</displayName>
					<description>I3C received message register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IBIRDCNT</name>
							<description>IBI received payload data count (when the I3C is configured as master)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RCODE</name>
							<description>received CCC code (when the I3C is configured as slave)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RADD</name>
							<description>received slave address (when the I3C is configured as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
