Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>SWIEVR</name>
					<displayName>SWIEVR</displayName>
					<description>Software interrupt event register (EXTI_SWIEVR)</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SWIER0</name>
							<description>Software Interrupt on line 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER1</name>
							<description>Software Interrupt on line 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER2</name>
							<description>Software Interrupt on line 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER3</name>
							<description>Software Interrupt on line 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER4</name>
							<description>Software Interrupt on line 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER5</name>
							<description>Software Interrupt on line 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER6</name>
							<description>Software Interrupt on line 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER7</name>
							<description>Software Interrupt on line 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER8</name>
							<description>Software Interrupt on line 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER9</name>
							<description>Software Interrupt on line 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER10</name>
							<description>Software Interrupt on line 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER11</name>
							<description>Software Interrupt on line 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER12</name>
							<description>Software Interrupt on line 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER13</name>
							<description>Software Interrupt on line 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER14</name>
							<description>Software Interrupt on line 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER15</name>
							<description>Software Interrupt on line 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER16</name>
							<description>Software Interrupt on line 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER17</name>
							<description>Software Interrupt on line 17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER19</name>
							<description>Software Interrupt on line 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER20</name>
							<description>Software Interrupt on line 20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER21</name>
							<description>Software Interrupt on line 21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER22</name>
							<description>Software Interrupt on line 22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER23</name>
							<description>Software Interrupt on line 23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER24</name>
							<description>Software Interrupt on line 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER25</name>
							<description>Software Interrupt on line 25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIER26</name>
							<description>Software Interrupt on line 26</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTFR</name>
					<displayName>INTFR</displayName>
					<description>interrupt flag register (EXTI_INTFR)</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IF0</name>
							<description>interrupt flag bit 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF1</name>
							<description>interrupt flag bit 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF2</name>
							<description>interrupt flag bit 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF3</name>
							<description>interrupt flag bit 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF4</name>
							<description>interrupt flag bit 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF5</name>
							<description>interrupt flag bit 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF6</name>
							<description>interrupt flag bit 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF7</name>
							<description>interrupt flag bit 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF8</name>
							<description>interrupt flag bit 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF9</name>
							<description>interrupt flag bit 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF10</name>
							<description>interrupt flag bit 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF11</name>
							<description>interrupt flag bit 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF12</name>
							<description>interrupt flag bit 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF13</name>
							<description>interrupt flag bit 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF14</name>
							<description>interrupt flag bit 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF15</name>
							<description>interrupt flag bit 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF16</name>
							<description>interrupt flag bit 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF17</name>
							<description>interrupt flag bit 17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF19</name>
							<description>interrupt flag bit 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF20</name>
							<description>interrupt flag bit 20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF21</name>
							<description>interrupt flag bit 21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF22</name>
							<description>interrupt flag bit 22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF23</name>
							<description>interrupt flag bit 23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF24</name>
							<description>interrupt flag bit 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF25</name>
							<description>interrupt flag bit 25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IF26</name>
							<description>interrupt flag bit 26</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
