Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>OPA</name>
			<description>OPA configuration</description>
			<groupName>OPA</groupName>
			<baseAddress>0x40017800</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OPA_CTLR1</name>
					<displayName>CTLR1</displayName>
					<description>OPA Control Register 1</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000076</resetValue>
					<fields>
						<field>
							<name>EN1</name>
							<description>OPA1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE1</name>
							<description>OPA1 Output Channel Selection</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PSEL1</name>
							<description>OPA1 Positive Channel Selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NSEL1</name>
							<description>OPA1 Negative Channel Selection vs. PGA Gain Selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FB_EN1</name>
							<description>OPA1's PGA mode feedback enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PGADIF1</name>
							<description>OPA1 is used with NSEL1 as PGA and the N-terminal is connected to OPA1_CHN1 (PA7)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HS1</name>
							<description>OPA1 high-speed mode enables</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OPA_CTLR2</name>
					<displayName>CTLR2</displayName>
					<description>OPA Control Register 2</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000070</resetValue>
					<fields>
						<field>
							<name>EN2</name>
							<description>OPA2 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE2</name>
							<description>OPA2 Output Channel Selection</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PSEL2</name>
							<description>OPA2 Positive Channel Selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NSEL2</name>
							<description>OPA2 Negative Channel Selection vs. PGA Gain Selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FB_EN2</name>
							<description>OPA2's PGA mode feedback enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PGADIF1</name>
							<description>OPA2 is used with NSEL1 as PGA and the N-terminal is connected to OPA2_CHN1 (PA7)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HS2</name>
							<description>OPA2 high-speed mode enables</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OPA_CTLR3</name>
					<displayName>CTLR3</displayName>
					<description>OPA Control Register 3</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000070</resetValue>
					<fields>
						<field>
							<name>EN3</name>
							<description>OPA3 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE3</name>
							<description>OPA3 Output Channel Selection</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PSEL3</name>
							<description>OPA3 Positive Channel Selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NSEL3</name>
							<description>OPA3 Negative Channel Selection vs. PGA Gain Selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FB_EN3</name>
							<description>OPA3's PGA mode feedback enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PGADIF3</name>
							<description>OPA3 is used with NSEL1 as PGA and the N-terminal is connected to OPA3_CHN1 (PA7)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HS3</name>
							<description>OPA3 high-speed mode enables</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP_CTLR</name>
					<displayName>CMP_CTLR</displayName>
					<description>CMP Control Registers</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<resetValue>0x000000FF</resetValue>
					<fields>
						<field>
							<name>PSEL</name>
							<description>CMP Positive Channel Selection Bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NSEL</name>
							<description>CMP Negative End Channel Selection Bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>CMP Output Channel Selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN</name>
							<description>CMP enables</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HYPSEL</name>
							<description>CMP hysteresis voltage selector</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VREF</name>
							<description>CMP Internal Bias Voltage Selector</description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILT_EN</name>
							<description>CMP Digital Filtering Enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILT_CFG</name>
							<description>CMP filter sampling interval configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILT_BASE</name>
							<description>CMP filtering sampling time base configuration</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP_STATR</name>
					<displayName>CMP_STATR</displayName>
					<description>CMP Status Registers</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OUT_FILT</name>
							<description>CMP Output</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
