Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>L2PFCR</name>
					<displayName>L2PFCR</displayName>
					<description>Layerx Pixel Format Configuration Register</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PF</name>
							<description>Pixel Format</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CACR</name>
					<displayName>L2CACR</displayName>
					<description>Layerx Constant Alpha Configuration Register</description>
					<addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CONSTA</name>
							<description>Constant Alpha</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2DCCR</name>
					<displayName>L2DCCR</displayName>
					<description>Layerx Default Color Configuration Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCALPHA</name>
							<description>Default Color Alpha</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DCRED</name>
							<description>Default Color Red</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DCGREEN</name>
							<description>Default Color Green</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DCBLUE</name>
							<description>Default Color Blue</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2BFCR</name>
					<displayName>L2BFCR</displayName>
					<description>Layerx Blending Factors Configuration Register</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000600</resetValue>
					<fields>
						<field>
							<name>BF1</name>
							<description>Blending Factor 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>BF2</name>
							<description>Blending Factor 2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CFBAR</name>
					<displayName>L2CFBAR</displayName>
					<description>Layerx Color Frame Buffer Address Register</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFBADD</name>
							<description>Color Frame Buffer Start Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CFBLR</name>
					<displayName>L2CFBLR</displayName>
					<description>Layerx Color Frame Buffer Length Register</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFBP</name>
							<description>Color Frame Buffer Pitch in bytes</description>
							<bitOffset>16</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>CFBLL</name>
							<description>Color Frame Buffer Line Length</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CFBLNR</name>
					<displayName>L2CFBLNR</displayName>
					<description>Layerx ColorFrame Buffer Line Number Register</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFBLNBR</name>
							<description>Frame Buffer Line Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CLUTWR</name>
					<displayName>L2CLUTWR</displayName>
					<description>Layerx CLUT Write Register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLUTADD</name>
							<description>CLUT Address</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>RED</name>
							<description>Red value</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>GREEN</name>
							<description>Green value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BLUE</name>
							<description>Blue value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>GPHA</name>
			<description>GPHA</description>
			<groupName>GPHA</groupName>
			<baseAddress>0x40016800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GPHA</name>
				<description>GPHA global interrupt</description>
				<value>125</value>
			</interrupt>
			<registers>
				<register>
					<name>CTLR</name>
					<displayName>CTLR</displayName>
					<description>GPHA control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>START</name>
							<description>Start This bit can be used to launch the GPHA according to the parameters loaded in the various configuration registers</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SUSP</name>
							<description>Suspend This bit can be used to suspend the current transfer.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ABORT</name>
							<description>Abort This bit can be used to abort the current transfer.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIE</name>
							<description>Transfer complete interrupt enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TWIE</name>
							<description>Transfer watermark interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAEIE</name>
							<description>CLUT access error interrupt enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIE</name>
							<description>CLUT transfer complete interrupt enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CEIE</name>
							<description>Configuration Error Interrupt Enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>GPHA mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>GPHA Interrupt Status Register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TCIF</name>
							<description>Transfer complete interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TWIF</name>
							<description>Transfer watermark interrupt flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAEIF</name>
							<description>CLUT access error interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF</name>
							<description>CLUT transfer complete interrupt flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CEIF</name>
							<description>Configuration error interrupt flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IFCR</name>
					<displayName>IFCR</displayName>
					<description>GPHA interrupt flag clear register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CTCIF</name>
							<description>Clear transfer complete interrupt flag Programming</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTWIF</name>
							<description>Clear transfer watermark interrupt flag Programming</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAECIF</name>
							<description>Clear CLUT access error interrupt flag Programming</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCTCIF</name>
							<description>Clear CLUT transfer complete interrupt flag Programming</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCEIF</name>
							<description>Clear configuration error interrupt flag Programming</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FGMAR</name>
					<displayName>FGMAR</displayName>
					<description>GPHA foreground memory address register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>Memory address Address of the data used for the foreground image.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FGOR</name>
					<displayName>FGOR</displayName>
					<description>GPHA foreground offset register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LO</name>
							<description>Line offset Line offset used for the foreground expressed in pixel</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BGMAR</name>
					<displayName>BGMAR</displayName>
					<description>GPHA background memory address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>Memory address Address of the data used for the background image</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BGOR</name>
					<displayName>BGOR</displayName>
					<description>GPHA background offset register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LO</name>
							<description>Line offset Line offset used for the background image (expressed in pixel)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FGPFCCR</name>
					<displayName>FGPFCCR</displayName>
					<description>GPHA foreground PFC control register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CM</name>
							<description>Color mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CCM</name>
							<description>CLUT color mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>START</name>
							<description>Start This bit can be set to start the automatic loading of the CLUT</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CS</name>
							<description>CLUT size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>AM</name>
							<description>Alpha mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>AI</name>
							<description>Alpha Inverted</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RBS</name>
							<description>Red Blue Swap</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALPHA</name>
							<description>Alpha value</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FGCOLR</name>
					<displayName>FGCOLR</displayName>
					<description>GPHA foreground color register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BLUE</name>
							<description>Blue Value These bits defines the blue value for the A4 or A8 mode of the foreground image</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>GREEN</name>
							<description>Green Value These bits defines the green value for the A4 or A8 mode of the foreground image</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>RED</name>
							<description>Red Value These bits defines the red value for the A4 or A8 mode of the foreground image</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BGPFCCR</name>
					<displayName>BGPFCCR</displayName>
					<description>GPHA background PFC control register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CM</name>
							<description>Color mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CCM</name>
							<description>CLUT Color mode These bits define the color format of the CLUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>START</name>
							<description>Start This bit is set to start the automatic loading of the CLUT</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CS</name>
							<description>CLUT size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>AM</name>
							<description>Alpha mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>AI</name>
							<description>Alpha Inverted</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RBS</name>
							<description>Red Blue Swap</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALPHA</name>
							<description>Alpha value</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BGCOLR</name>
					<displayName>BGCOLR</displayName>
					<description>GPHA background color register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BLUE</name>
							<description>Blue Value These bits define the blue value for the A4 or A8 mode of the background</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>GREEN</name>
							<description>Green Value These bits define the green value for the A4 or A8 mode of the background</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>RED</name>
							<description>Red Value These bits define the red value for the A4 or A8 mode of the background</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FGCMAR</name>
					<displayName>FGCMAR</displayName>
					<description>GPHA foreground CLUT memory address register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>Memory Address Address of the data used for the CLUT address dedicated to the foreground image</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BGCMAR</name>
					<displayName>BGCMAR</displayName>
					<description>GPHA background CLUT memory address register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>Memory address Address of the data used for the CLUT address dedicated to the background image</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OPFCCR</name>
					<displayName>OPFCCR</displayName>
					<description>GPHA output PFC control register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CM</name>
							<description>Color mode These bits define the color format of the output image</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>AI</name>
							<description>Alpha Inverted This bit inverts the alpha value</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RBS</name>
							<description>Red Blue Swap</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OCOLR</name>
					<displayName>OCOLR</displayName>
					<description>GPHA output color register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BLUE</name>
							<description>Blue Value These bits define the blue value of the output image</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>GREEN</name>
							<description>Green Value These bits define the green value of the output image</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>RED</name>
							<description>Red Value These bits define the red value of the output image</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ALPHA</name>
							<description>Alpha Channel Value These bits define the alpha channel of the output color</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OMAR</name>
					<displayName>OMAR</displayName>
					<description>GPHA output memory address register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>Memory Address Address of the data used for the output FIFO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OOR</name>
					<displayName>OOR</displayName>
					<description>GPHA output offset register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LO</name>
							<description>Line Offset Line offset used for the output (expressed in pixels)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>NLR</name>
					<displayName>NLR</displayName>
					<description>GPHA number of line register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NL</name>
							<description>Number of lines Number of lines of the area to be transferred</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>PL</name>
							<description>Pixel per lines Number of pixels per lines of the area to be transferred</description>
							<bitOffset>16</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LWR</name>
					<displayName>LWR</displayName>
					<description>GPHA line watermark register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LW</name>
							<description>Line watermark These bits allow to configure the line watermark for interrupt generation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
