Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>DFSDM_FLT0FCR3</name>
					<displayName>FLT0FCR3</displayName>
					<description>control register 3</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FORD</name>
							<description>Sinc Filter Order</description>
							<bitOffset>29</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FOSR</name>
							<description>Sinc filter oversampling rate</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IOSR</name>
							<description>The integrator oversampling rate is 2 to the power of IOSR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0JDATAR</name>
					<displayName>DFSDM_FLT0JDATAR</displayName>
					<description>data register for injected group</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA</name>
							<description>Injected group conversion data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>JDATACH</name>
							<description>Injected channel most recently converted</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0RDATAR</name>
					<displayName>DFSDM_FLT0RDATAR</displayName>
					<description>data register for the regular channel</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RDATA</name>
							<description>Regular channel conversion data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>RPEND</name>
							<description>Regular channel pending data</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDATACH</name>
							<description>Regular channel most recently converted</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0AWHTR</name>
					<displayName>DFSDM_FLT0AWHTR</displayName>
					<description>analog watchdog high threshold register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWHT</name>
							<description>Analog watchdog high threshold</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>BKAWH</name>
							<description>Break signal assignment to analog watchdog high threshold event</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0AWLTR</name>
					<displayName>DFSDM_FLT0AWLTR</displayName>
					<description>analog watchdog low threshold register</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWLT</name>
							<description>Analog watchdog low threshold</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>BKAWL</name>
							<description>Break signal assignment to analog watchdog low threshold event</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0AWSR</name>
					<displayName>DFSDM_FLT0AWSR</displayName>
					<description>analog watchdog status register</description>
					<addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWHTF</name>
							<description>Analog watchdog high threshold flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>AWLTF</name>
							<description>Analog watchdog low threshold flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0AWCFR</name>
					<displayName>DFSDM_FLT0AWCFR</displayName>
					<description>analog watchdog clear flag register</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRAWHTF</name>
							<description>Clear the analog watchdog high threshold flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CLRAWLTF</name>
							<description>Clear the analog watchdog low threshold flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0EXMAX</name>
					<displayName>DFSDM_FLT0EXMAX</displayName>
					<description>Extremes detector maximum register</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXMAX</name>
							<description>Extremes detector maximum value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>EXMAXCH</name>
							<description>Extremes detector maximum data channel</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0EXMIN</name>
					<displayName>DFSDM_FLT0EXMIN</displayName>
					<description>Extremes detector minimum register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXMIN</name>
							<description>EXMIN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>EXMINCH</name>
							<description>Extremes detector minimum data channel</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0CNVTIMR</name>
					<displayName>DFSDM_FLT0CNVTIMR</displayName>
					<description>conversion timer register</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNVCNT</name>
							<description>28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>28</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1CR1</name>
					<displayName>DFSDM_FLT1CR1</displayName>
					<description>control register 1</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWFSEL</name>
							<description>Analog watchdog fast mode select</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FAST</name>
							<description>Fast conversion mode selection for regular conversions</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RCH</name>
							<description>Regular channel selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>RDMAEN</name>
							<description>DMA channel enabled to read data for the regular conversion</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSYNC</name>
							<description>Launch regular conversion synchronously with DFSDM0</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RCONT</name>
							<description>Continuous mode selection for regular conversions</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSWSTART</name>
							<description>Software start of a conversion on the regular channel</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEXTEN</name>
							<description>Trigger enable and trigger edge selection for injected conversions</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>JEXTSEL</name>
							<description>Trigger signal selection for launching injected conversions</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>JDMAEN</name>
							<description>DMA channel enabled to read data for the injected channel group</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSCAN</name>
							<description>Scanning conversion mode for injected conversions</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSYNC</name>
							<description>Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSWSTART</name>
							<description>Start a conversion of the injected group of channels</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFEN</name>
							<description>DFSDM enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1CR2</name>
					<displayName>DFSDM_FLT1CR2</displayName>
					<description>control register 2</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDCH</name>
							<description>Analog watchdog channel selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>EXCH</name>
							<description>Extremes detector channel selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CKABIE</name>
							<description>Clock absence interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCDIE</name>
							<description>Short-circuit detector interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDIE</name>
							<description>Analog watchdog interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ROVRIE</name>
							<description>Regular data overrun interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JOVRIE</name>
							<description>Injected data overrun interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REOCIE</name>
							<description>Regular end of conversion interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOCIE</name>
							<description>Injected end of conversion interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1ISR</name>
					<displayName>DFSDM_FLT1ISR</displayName>
					<description>interrupt and status register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SCDF</name>
							<description>short-circuit detector flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CKABF</name>
							<description>Clock absence flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>RCIP</name>
							<description>Regular conversion in progress status</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JCIP</name>
							<description>Injected conversion in progress status</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDF</name>
							<description>Analog watchdog</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ROVRF</name>
							<description>Regular conversion overrun flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JOVRF</name>
							<description>Injected conversion overrun flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REOCF</name>
							<description>End of regular conversion flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOCF</name>
							<description>End of injected conversion flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1ICR</name>
					<displayName>DFSDM_FLT1ICR</displayName>
					<description>interrupt flag clear register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRSCDF</name>
							<description>Clear the short-circuit detector flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CLRCKABF</name>
							<description>Clear the clock absence flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CLRROVRF</name>
							<description>Clear the regular conversion overrun flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CLRJOVRF</name>
							<description>Clear the injected conversion overrun flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1JCHGR</name>
					<displayName>DFSDM_FLT1JCHGR</displayName>
					<description>injected channel group selection register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>JCHG</name>
							<description>Injected channel group selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1FCR3</name>
					<displayName>FLT1FCR3</displayName>
					<description>control register 3</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FORD</name>
							<description>Sinc Filter Order</description>
							<bitOffset>29</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FOSR</name>
							<description>Sinc filter oversampling rate</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IOSR</name>
							<description>The integrator oversampling rate is 2 to the power of IOSR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1JDATAR</name>
					<displayName>DFSDM_FLT1JDATAR</displayName>
					<description>data register for injected group</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA</name>
							<description>Injected group conversion data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>JDATACH</name>
							<description>Injected channel most recently converted</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1RDATAR</name>
					<displayName>DFSDM_FLT1RDATAR</displayName>
					<description>data register for the regular channel</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RDATA</name>
							<description>Regular channel conversion data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>RPEND</name>
							<description>Regular channel pending data</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDATACH</name>
							<description>Regular channel most recently converted</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1AWHTR</name>
					<displayName>DFSDM_FLT1AWHTR</displayName>
					<description>analog watchdog high threshold register</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWHT</name>
							<description>Analog watchdog high threshold</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>BKAWH</name>
							<description>Break signal assignment to analog watchdog high threshold event</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1AWLTR</name>
					<displayName>DFSDM_FLT1AWLTR</displayName>
					<description>analog watchdog low threshold register</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWLT</name>
							<description>Analog watchdog low threshold</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>BKAWL</name>
							<description>Break signal assignment to analog watchdog low threshold event</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1AWSR</name>
					<displayName>DFSDM_FLT1AWSR</displayName>
					<description>analog watchdog status register</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWHTF</name>
							<description>Analog watchdog high threshold flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>AWLTF</name>
							<description>Analog watchdog low threshold flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1AWCFR</name>
					<displayName>DFSDM_FLT1AWCFR</displayName>
					<description>analog watchdog clear flag register</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRAWHTF</name>
							<description>Clear the analog watchdog high threshold flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CLRAWLTF</name>
							<description>Clear the analog watchdog low threshold flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1EXMAX</name>
					<displayName>DFSDM_FLT1EXMAX</displayName>
					<description>Extremes detector maximum register</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXMAX</name>
							<description>Extremes detector maximum value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>EXMAXCH</name>
							<description>Extremes detector maximum data channel</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1EXMIN</name>
					<displayName>DFSDM_FLT1EXMIN</displayName>
					<description>Extremes detector minimum register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXMIN</name>
							<description>EXMIN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>EXMINCH</name>
							<description>Extremes detector minimum data channel</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT1CNVTIMR</name>
					<displayName>DFSDM_FLT1CNVTIMR</displayName>
					<description>conversion timer register</description>
					<addressOffset>0x9C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNVCNT</name>
							<description>28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>28</bitWidth>
						</field>
					</fields>
				</register>
