Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SAI</name>
			<description>SAI</description>
			<groupName>SAI</groupName>
			<baseAddress>0x40015800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SAI</name>
				<description>SAI global interrupt</description>
				<value>123</value>
			</interrupt>
			<registers>
				<register>
					<name>SAI_ACFGR1</name>
					<displayName>SAI_ACFGR1</displayName>
					<description>Configuration register 1</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000040</resetValue>
					<fields>
						<field>
							<name>MODE</name>
							<description>SAIx audio block mode immediately</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PRTCFG</name>
							<description>Protocol configuration</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DS</name>
							<description>Data size</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>LSBFIRST</name>
							<description>Least significant bit first</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKSTR</name>
							<description>Clock strobing edge</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYNCEN</name>
							<description>Synchronization enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MONO</name>
							<description>Mono mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAIXEN</name>
							<description>Audio block enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NOMCK</name>
							<description>No divider</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MCKDIV</name>
							<description>Master clock divider</description>
							<bitOffset>20</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>OSR</name>
							<description>Oversampling ratio for master clock</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_ACFGR2</name>
					<displayName>SAI_ACFGR2</displayName>
					<description>Configuration register 2</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FTH</name>
							<description>FIFO threshold</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FFLUSH</name>
							<description>FIFO flush</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIS</name>
							<description>Tristate management on data line</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTE</name>
							<description>Mute mode enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTEVAL</name>
							<description>Mute value</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTECNT</name>
							<description>Mute counter</description>
							<bitOffset>7</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPL</name>
							<description>Complement bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP</name>
							<description>Companding mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_AFRCR</name>
					<displayName>SAI_AFRCR</displayName>
					<description>This register has no meaning in AC97 and SPDIF audio protocol</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000007</resetValue>
					<fields>
						<field>
							<name>FRL</name>
							<description>Frame length</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSALL</name>
							<description>Frame synchronization active level length</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSDEF</name>
							<description>Frame synchronization definition</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FSPOL</name>
							<description>Frame synchronization polarity</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSOFF</name>
							<description>Frame synchronization offset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_ASLOTR</name>
					<displayName>SAI_ASLOTR</displayName>
					<description>This register has no meaning in AC97 and SPDIF audio protocol</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FBOFF</name>
							<description>First bit offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SLOTSZ</name>
							<description>Slot size</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>NBSLOT</name>
							<description>Number of slots in an audio frame</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SLOTEN</name>
							<description>Slot enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_AINTENR</name>
					<displayName>SAI_AINTENR</displayName>
					<description>Interrupt mask register 2</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OVRUDRIE</name>
							<description>Overrun/underrun interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUTEDETIE</name>
							<description>Mute detection interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WCKCFGIE</name>
							<description>Wrong clock configuration interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FREQIE</name>
							<description>FIFO request interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNRDYIE</name>
							<description>Codec not ready interrupt enable (AC97).</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AFSDETIE</name>
							<description>Anticipated frame synchronization detection interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LFSDETIE</name>
							<description>Late frame synchronization detection interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_ASR</name>
					<displayName>SAI_ASR</displayName>
					<description>Status register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000008</resetValue>
					<fields>
						<field>
							<name>OVRUDR</name>
							<description>Overrun/underrun error flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTEDET</name>
							<description>Mute detection flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WCKCFG</name>
							<description>Wrong clock configuration error flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FREQ</name>
							<description>FIFO request flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNRDY</name>
							<description>Codec not ready</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFSDET</name>
							<description>Anticipated frame synchronization detection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LFSDET</name>
							<description>Late frame synchronization detection</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FLVL</name>
							<description>FIFO level threshold</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_ADATAR</name>
					<displayName>SAI_ADATAR</displayName>
					<description>Data register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_BCFGR1</name>
					<displayName>SAI_BCFGR1</displayName>
					<description>Configuration register 1</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000040</resetValue>
					<fields>
						<field>
							<name>MODE</name>
							<description>SAIx audio block mode immediately</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PRTCFG</name>
							<description>Protocol configuration</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DS</name>
							<description>Data size</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>LSBFIRST</name>
							<description>Least significant bit first</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKSTR</name>
							<description>Clock strobing edge</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYNCEN</name>
							<description>Synchronization enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MONO</name>
							<description>Mono mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUTDRIV</name>
							<description>Output drive</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAIXEN</name>
							<description>Audio block enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NOMCK</name>
							<description>No divider</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MCKDIV</name>
							<description>Master clock divider</description>
							<bitOffset>20</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>OSR</name>
							<description>Oversampling ratio for master clock</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_BCFGR2</name>
					<displayName>SAI_BCFGR2</displayName>
					<description>Configuration register 2</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FTH</name>
							<description>FIFO threshold</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FFLUSH</name>
							<description>FIFO flush</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIS</name>
							<description>Tristate management on data line</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTE</name>
							<description>Mute mode enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTEVAL</name>
							<description>Mute value</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTECNT</name>
							<description>Mute counter</description>
							<bitOffset>7</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPL</name>
							<description>Complement bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP</name>
							<description>Companding mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_BFRCR</name>
					<displayName>SAI_BFRCR</displayName>
					<description>This register has no meaning in AC97 and SPDIF audio protocol</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000007</resetValue>
					<fields>
						<field>
							<name>FRL</name>
							<description>Frame length</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSALL</name>
							<description>Frame synchronization active level length</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSDEF</name>
							<description>Frame synchronization definition</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FSPOL</name>
							<description>Frame synchronization polarity</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSOFF</name>
							<description>Frame synchronization offset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_BSLOTR</name>
					<displayName>SAI_BSLOTR</displayName>
					<description>This register has no meaning in AC97 and SPDIF audio protocol</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FBOFF</name>
							<description>First bit offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SLOTSZ</name>
							<description>Slot size</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>NBSLOT</name>
							<description>Number of slots in an audio frame</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SLOTEN</name>
							<description>Slot enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_BINTENR</name>
					<displayName>SAI_BINTENR</displayName>
					<description>Interrupt mask register 2</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OVRUDRIE</name>
							<description>Overrun/underrun interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUTEDETIE</name>
							<description>Mute detection interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WCKCFGIE</name>
							<description>Wrong clock configuration interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FREQIE</name>
							<description>FIFO request interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNRDYIE</name>
							<description>Codec not ready interrupt enable (AC97).</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AFSDETIE</name>
							<description>Anticipated frame synchronization detection interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LFSDETIE</name>
							<description>Late frame synchronization detection interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_BSR</name>
					<displayName>SAI_BSR</displayName>
					<description>Status register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000008</resetValue>
					<fields>
						<field>
							<name>OVRUDR</name>
							<description>Overrun/underrun error flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MUTEDET</name>
							<description>Mute detection flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WCKCFG</name>
							<description>Wrong clock configuration error flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FREQ</name>
							<description>FIFO request flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNRDY</name>
							<description>Codec not ready</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFSDET</name>
							<description>Anticipated frame synchronization detection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LFSDET</name>
							<description>Late frame synchronization detection</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FLVL</name>
							<description>FIFO level threshold</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SAI_BDATAR</name>
					<displayName>SAI_BDATAR</displayName>
					<description>Data register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
