Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>FMC</name>
			<description>FMC</description>
			<groupName>FMC</groupName>
			<baseAddress>0x40025400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FMC</name>
				<description>FMC global interrupt</description>
				<value>94</value>
			</interrupt>
			<registers>
				<register>
					<name>BCR1</name>
					<displayName>BCR1</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00003052</resetValue>
					<fields>
						<field>
							<name>MBKEN</name>
							<description>Memory bank enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUXEN</name>
							<description>Address/data multiplexing enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MTYP</name>
							<description>Memory type</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MWID</name>
							<description>Memory data bus width Defines the external memory device width, valid for all type of memories.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FACCEN</name>
							<description>Flash access enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>Burst enable bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITPOL</name>
							<description>Wait signal polarity bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITCFG</name>
							<description>Wait timing configuration</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>Write enable bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>Wait enable bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMOD</name>
							<description>Extended mode enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ASYNCWAIT</name>
							<description>Wait signal during asynchronous transfers</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPSIZE</name>
							<description>CRAM Page Size</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CBURSTRW</name>
							<description>Write burst enable</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BMP</name>
							<description>FMC bank mapping</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FMC_EN</name>
							<description>FMC controller Enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BTR1</name>
					<displayName>BTR1</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>Clock divide ratio (for FMC_CLK signal)</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATLAT</name>
							<description>Data latency for synchronous memory For synchronous access with read write burst mode enabled</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BCR2</name>
					<displayName>BCR2</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000030D2</resetValue>
					<fields>
						<field>
							<name>MBKEN</name>
							<description>Memory bank enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUXEN</name>
							<description>Address/data multiplexing enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MTYP</name>
							<description>Memory type</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MWID</name>
							<description>Memory data bus width Defines the external memory device width, valid for all type of memories.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FACCEN</name>
							<description>Flash access enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>Burst enable bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITPOL</name>
							<description>Wait signal polarity bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITCFG</name>
							<description>Wait timing configuration</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>Write enable bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>Wait enable bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMOD</name>
							<description>Extended mode enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ASYNCWAIT</name>
							<description>Wait signal during asynchronous transfers</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPSIZE</name>
							<description>CRAM Page Size</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CBURSTRW</name>
							<description>Write burst enable For PSRAM (CRAM) operating in Burst mode</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BMP</name>
							<description>FMC bank mapping</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FMC_EN</name>
							<description>FMC controller Enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BTR2</name>
					<displayName>BTR2</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>Clock divide ratio (for FMC_CLK signal)</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATLAT</name>
							<description>Data latency for synchronous memory For synchronous access with read write burst mode enabled</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BCR3</name>
					<displayName>BCR3</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000030D2</resetValue>
					<fields>
						<field>
							<name>MBKEN</name>
							<description>Memory bank enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUXEN</name>
							<description>Address/data multiplexing enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MTYP</name>
							<description>Memory type</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MWID</name>
							<description>Memory data bus width Defines the external memory device width, valid for all type of memories.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FACCEN</name>
							<description>Flash access enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>Burst enable bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITPOL</name>
							<description>Wait signal polarity bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITCFG</name>
							<description>Wait timing configuration</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>Write enable bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>Wait enable bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMOD</name>
							<description>Extended mode enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ASYNCWAIT</name>
							<description>Wait signal during asynchronous transfers</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPSIZE</name>
							<description>CRAM Page Size</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CBURSTRW</name>
							<description>Write burst enable For PSRAM (CRAM) operating in Burst mode</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BMP</name>
							<description>FMC bank mapping</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FMC_EN</name>
							<description>FMC controller Enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BTR3</name>
					<displayName>BTR3</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>Clock divide ratio (for FMC_CLK signal)</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATLAT</name>
							<description>Data latency for synchronous memory For synchronous access with read write burst mode enabled</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BCR4</name>
					<displayName>BCR4</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000030D2</resetValue>
					<fields>
						<field>
							<name>MBKEN</name>
							<description>Memory bank enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUXEN</name>
							<description>Address/data multiplexing enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MTYP</name>
							<description>Memory type</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MWID</name>
							<description>Memory data bus width Defines the external memory device width, valid for all type of memories.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FACCEN</name>
							<description>Flash access enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>Burst enable bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITPOL</name>
							<description>Wait signal polarity bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITCFG</name>
							<description>Wait timing configuration</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>Write enable bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>Wait enable bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMOD</name>
							<description>Extended mode enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ASYNCWAIT</name>
							<description>Wait signal during asynchronous transfers</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPSIZE</name>
							<description>CRAM Page Size</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CBURSTRW</name>
							<description>Write burst enable For PSRAM (CRAM) operating in Burst mode</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BMP</name>
							<description>FMC bank mapping</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FMC_EN</name>
							<description>FMC controller Enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BTR4</name>
					<displayName>BTR4</displayName>
					<description>This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>Clock divide ratio (for FMC_CLK signal)</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATLAT</name>
							<description>Data latency for synchronous memory For synchronous access with read write burst mode enabled</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PCR</name>
					<displayName>PCR</displayName>
					<description>NAND Flash control registers</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000018</resetValue>
					<fields>
						<field>
							<name>PWAITEN</name>
							<description>Wait feature enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBKEN</name>
							<description>NAND Flash memory bank enable bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PTYP</name>
							<description>memory type</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWID</name>
							<description>Data bus width</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ECCEN</name>
							<description>ECC computation logic enable bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCLR</name>
							<description>CLE to RE delay</description>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TAR</name>
							<description>ALE to RE delay</description>
							<bitOffset>13</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ECCPS</name>
							<description>ECC page size</description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
