Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>IPC</name>
			<description>Inter-cpre communication</description>
			<groupName>IPC</groupName>
			<baseAddress>0xE000D000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>IPC_CH0</name>
				<description>IPC global interrupt 0</description>
				<value>16</value>
			</interrupt>
			<interrupt>
				<name>IPC_CH1</name>
				<description>IPC global interrupt 1</description>
				<value>17</value>
			</interrupt>
			<interrupt>
				<name>IPC_CH2</name>
				<description>IPC global interrupt 2</description>
				<value>18</value>
			</interrupt>
			<interrupt>
				<name>IPC_CH3</name>
				<description>IPC global interrupt 3</description>
				<value>19</value>
			</interrupt>
			<registers>
				<register>
					<name>CTLR</name>
					<displayName>CTLR</displayName>
					<description>IPC control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TX_CID0</name>
							<description>The ID of the sender kernel to specify the kernel that responds to the sending interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_CID0</name>
							<description>The ID of the kernel on the receiver side, which is configured to respond to the receive interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_IER0</name>
							<description>Channel 0 transmitter interrupt is enabled, and channel 0 can generate transmit interrupt when set to 1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_IER0</name>
							<description>Channel 0 receiver interrupt is enabled, and channel 0 can generate a receive interrupt when 1 is set</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOEN0</name>
							<description>The channel 0 status bit enables automatic updates</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK0</name>
							<description>Channel 0 is configured locked</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_CID1</name>
							<description>The ID of the sender kernel to specify the kernel that responds to the sending interrupt</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_CID1</name>
							<description>The ID of the kernel on the receiver side, which is configured to respond to the receive interrupt</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_IER1</name>
							<description>Channel 1 transmitter interrupt is enabled, and channel 1 can generate a transmit interrupt when 1 is set</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_IER1</name>
							<description>Channel 1 receiver interrupt is enabled, and channel 1 can generate receive interrupt when 1 is set</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOEN1</name>
							<description>Channel 1 status bits enable automatic updates</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK1</name>
							<description>Channel 1 configuration locks</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_CID2</name>
							<description>The ID of the sender kernel to specify the kernel that responds to the sending interrupt</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_CID2</name>
							<description>The ID of the kernel on the receiver side, which is configured to respond to the receive interrupt</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_IER2</name>
							<description>Channel 2 transmitter interrupt is enabled, and channel 2 can generate a transmit interrupt when 1 is set</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_IER2</name>
							<description>Channel 2 receiver interrupt is enabled, and channel 2 can generate a receive interrupt when 1 is set</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOEN2</name>
							<description>Channel 2 status bits are enabled to be updated automatically</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK2</name>
							<description>Channel 2 configuration locking</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_CID3</name>
							<description>The ID of the sender kernel and the kernel that responds to the send interrupt</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_CID3</name>
							<description>Receiver kernel ID, configure the kernel that responds to receive interrupts</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_IER3</name>
							<description>Channel 3 transmitter interrupt is enabled, and channel 3 can generate a transmit interrupt when 1 is set</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_IER3</name>
							<description>Channel 3 receiver interrupt is enabled, and channel 3 can generate receive interrupt when set to 1</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOEN3</name>
							<description>The status bit of channel 3 is automatically updated, when the receiver writes IPC _STS when 1, the IPC_ENA is automatically updated to the same value, and when the receiver writes IPC_SET to the IPC_STS, the corresponding position bit is IPC_ENA when the receiver writes to the IPC_STS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK3</name>
							<description>Channel 3 is locked, and only reset can be cleared after write 1, and other control registers of channel 3 cannot be overridden after locking</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>IPC interrupt status register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_ISR0</name>
							<description>IPC channel 0 interrupt status register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC_ISR1</name>
							<description>IPC channel 1 interrupt status register</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC_ISR2</name>
							<description>IPC channel 2 interrupt status register</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC_ISR3</name>
							<description>IPC channel 3 interrupt status register</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISM</name>
					<displayName>ISM</displayName>
					<description>IPC ISM channel interrupt mask register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_ISM0</name>
							<description>IPC channel 0 interrupts the mask register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC_ISM1</name>
							<description>IPC channel 1 interrupts the mask register</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC_ISM2</name>
							<description>IPC channel 2 interrupts the mask register</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC_ISM3</name>
							<description>IPC channel 3 interrupts the mask register</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ENA</name>
					<displayName>ENA</displayName>
					<description>IPC status bit interrupt enable register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_ENA0</name>
							<description>IPC channel 0 flag interrupt enable register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC_ENA1</name>
							<description>IPC channel 1 flag interrupt enable register</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC_ENA2</name>
							<description>IPC channel 2 flag interrupt enable register</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC_ENA3</name>
							<description>IPC channel 3 flag interrupt enable register</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>IPC channel status registers</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_STS0</name>
							<description>IPC channel 0 status register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC_STS1</name>
							<description>IPC channel 1 status register</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC_STS2</name>
							<description>IPC channel 2 status register</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC_STS3</name>
							<description>IPC channel 3 status register</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SET</name>
					<displayName>SET</displayName>
					<description>IPC Status Flag Position Bit Register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_SET0</name>
							<description>IPC channel 0 status flag position bit register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IPC_SET1</name>
							<description>IPC channel 1 status flag position bit register</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IPC_SET2</name>
							<description>IPC channel 2 status flag position bit register</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IPC_SET3</name>
							<description>IPC channel 3 status flag position bit register</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLR</name>
					<displayName>CLR</displayName>
					<description>IPC Status Flag Bit Reset Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_CLR0</name>
							<description>The status flag of IPC channel 0 clears the register, and the corresponding bit of the IPC _STS register is reset after writing 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IPC_CLR1</name>
							<description>The status flag of IPC channel 1 clears the register, and the corresponding bit of the IPC _STS register is reset after writing 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IPC_CLR2</name>
							<description>The status flag of IPC channel 2 clears the register, and the corresponding bit of the IPC _STS register is reset after writing 1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IPC_CLR3</name>
							<description>The status flag of IPC channel 3 clears the register, and the corresponding bit of the IPC _STS register is reset after writing 1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MSG0</name>
					<displayName>MSG0</displayName>
					<description>IPC information register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_MSG0</name>
							<description>IPC information registers are used to store and transmit information that needs to be passed on for inter-core communication</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MSG1</name>
					<displayName>MSG1</displayName>
					<description>IPC information register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_MSG1</name>
							<description>IPC information registers are used to store and transmit information that needs to be passed on for inter-core communication</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MSG2</name>
					<displayName>MSG2</displayName>
					<description>IPC information register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_MSG2</name>
							<description>IPC information registers are used to store and transmit information that needs to be passed on for inter-core communication</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MSG3</name>
					<displayName>MSG3</displayName>
					<description>IPC information register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPC_MSG3</name>
							<description>IPC information registers are used to store and transmit information that needs to be passed on for inter-core communication</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
