Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>STK</name>
			<description>SysTick</description>
			<groupName>STK</groupName>
			<baseAddress>0xE000F000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>STK_CTLR_0</name>
					<displayName>STK_CTLR_0</displayName>
					<description>System count control register 0</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN_0</name>
							<description>System counter 0 enable control bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_0</name>
							<description>Counter 0 interrupt enable control bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NO_RTC_0</name>
							<description>Counter Clock Source Selection Bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTO_RELOAD_0</name>
							<description>Auto Reload Count Enable Bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DOWN_MODE_0</name>
							<description>Counting Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CID_0</name>
							<description>Counter 0 allocates a kernel register</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_ISR</name>
					<displayName>STK_ISR</displayName>
					<description>System counter interrupt status register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STK_ISR0</name>
							<description>Systick0 Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STK_ISR1</name>
							<description>Systick1 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CNT_0</name>
					<displayName>STK_CNT_0</displayName>
					<description>System counter 0 count register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT_0</name>
							<description>Systick0 counter register, counts are enabled and accumulate/subtract and automatically reload according to configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CMP_0</name>
					<displayName>STK_CMP_0</displayName>
					<description>System counter 0 comparison register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP_0</name>
							<description>Systick0 comparison register for automatic reloading when counting up and comparing when counting down</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CTLR_1</name>
					<displayName>STK_CTLR_1</displayName>
					<description>System count control register 1</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN_1</name>
							<description>System counter 1 enable control bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_1</name>
							<description>Counter 1 interrupt enable control bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NO_RTC_1</name>
							<description>Counter Clock Source Selection Bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTO_RELOAD_1</name>
							<description>Auto Reload Count Enable Bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DOWN_MODE_1</name>
							<description>Counting Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CID_1</name>
							<description>Counter 1 allocates a kernel register</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CNT_1</name>
					<displayName>STK_CNT_1</displayName>
					<description>System counter 1 count register</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT_1</name>
							<description>Systick1 counter register, counts are enabled and accumulate/subtract and automatically reload according to configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CMP_1</name>
					<displayName>STK_CMP_1</displayName>
					<description>System counter 1 comparison register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP_1</name>
							<description>Systick1 comparison register for automatic reloading when counting up and comparing when counting down</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
