Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HSEM</name>
			<description>HSEM</description>
			<groupName>HSEM</groupName>
			<baseAddress>0xE00C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>HSEM</name>
				<description>HSEM global interrupt</description>
				<value>28</value>
			</interrupt>
			<registers>
				<register>
					<name>HSEM_RX0</name>
					<displayName>HSEM_RX0</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX1</name>
					<displayName>HSEM_RX1</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX2</name>
					<displayName>HSEM_RX2</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX3</name>
					<displayName>HSEM_RX3</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX4</name>
					<displayName>HSEM_RX4</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX5</name>
					<displayName>HSEM_RX5</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX6</name>
					<displayName>HSEM_RX6</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX7</name>
					<displayName>HSEM_RX7</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX8</name>
					<displayName>HSEM_RX8</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX9</name>
					<displayName>HSEM_RX9</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX10</name>
					<displayName>HSEM_RX10</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX11</name>
					<displayName>HSEM_RX11</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX12</name>
					<displayName>HSEM_RX12</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX13</name>
					<displayName>HSEM_RX13</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX14</name>
					<displayName>HSEM_RX14</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX15</name>
					<displayName>HSEM_RX15</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX16</name>
					<displayName>HSEM_RX16</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX17</name>
					<displayName>HSEM_RX17</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX18</name>
					<displayName>HSEM_RX18</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX19</name>
					<displayName>HSEM_RX19</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX20</name>
					<displayName>HSEM_RX20</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX21</name>
					<displayName>HSEM_RX21</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX22</name>
					<displayName>HSEM_RX22</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX23</name>
					<displayName>HSEM_RX23</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX24</name>
					<displayName>HSEM_RX24</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX25</name>
					<displayName>HSEM_RX25</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX26</name>
					<displayName>HSEM_RX26</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX27</name>
					<displayName>HSEM_RX27</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
