Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>HSEM_RLRX25</name>
					<displayName>HSEM_RLRX25</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x164</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX26</name>
					<displayName>HSEM_RLRX26</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x168</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX27</name>
					<displayName>HSEM_RLRX27</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x16C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX28</name>
					<displayName>HSEM_RLRX28</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x170</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX29</name>
					<displayName>HSEM_RLRX29</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x174</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX30</name>
					<displayName>HSEM_RLRX30</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x178</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX31</name>
					<displayName>HSEM_RLRX31</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x17C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_IER</name>
					<displayName>HSEM_IER</displayName>
					<description>HSEM interrupt enable register</description>
					<addressOffset>0x300</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSEM_IER</name>
							<description>HSEM channel interrupt enable register, kernel private register, set to 1 when the corresponding channel is unlocked by other cores to allow interrupts. Interaction with HSEM_ISR registers can produce interrupts</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_ISR</name>
					<displayName>HSEM_ISR</displayName>
					<description>HSEM interrupt status register</description>
					<addressOffset>0x308</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSEM_IER</name>
							<description>HSEM channel interrupt enable register, kernel private register, set to 1 when the corresponding channel is unlocked by other cores to allow interrupts. Interaction with HSEM_ISR registers can produce interrupts</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_ISM</name>
					<displayName>HSEM_ISM</displayName>
					<description>HSEM interrupt mask register</description>
					<addressOffset>0x310</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSEM_ISM</name>
							<description>HSEM channel lock status registers to obtain the lock status of 32 channels</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_LSE</name>
					<displayName>HSEM_LSE</displayName>
					<description>HSEM lock status register</description>
					<addressOffset>0x200</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSEM_LSE</name>
							<description>HSEM channel lock status registers to obtain the lock status of 32 channels</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_LSM</name>
					<displayName>HSEM_LSM</displayName>
					<description>HSEM Lock Status Mask Register</description>
					<addressOffset>0x318</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSEM_LSE</name>
							<description>HSEM channel lock status registers to obtain the lock status of 32 channels</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_CLR</name>
					<displayName>HSEM_CLR</displayName>
					<description>HSEM Unlock Register</description>
					<addressOffset>0x208</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>match_PID</name>
							<description>It is used to match the unlocked PID value and compare it with the PID value of each locked channel</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>match_CID</name>
							<description>It is used to match the unlocked CID value and compare it with the CID value of each locked channel</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PID_MASK</name>
							<description>PID Matching Shielding</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CID_MASK</name>
							<description>CID Matching Shielding</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_KEY</name>
							<description>Unlock keywords, the operation is valid when the write data is equal to the matching keyword, otherwise it is invalid. The key value is 0x5AA5</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_KEY</name>
					<displayName>HSEM_KEY</displayName>
					<description>HSEM unlocks the keyword register</description>
					<addressOffset>0x20C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>auto_1step_clr</name>
							<description>When the channel is locked in 1step mode, the corresponding channel interrupt status bit is automatically cleared.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>auto_2step_clr</name>
							<description>When the channel is locked in 2step mode, the corresponding channel interrupt status bit is automatically cleared.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>KEY_VALUE</name>
							<description>Unlock keywords, which are used to match unlock method keyword comparisons.</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
