Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>IACTR1</name>
					<displayName>IACTR1</displayName>
					<description>Interrupt ACTIVE Register</description>
					<addressOffset>0x300</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IACTS2_3</name>
							<description>IACTS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IACTS5</name>
							<description>IACTS</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IACTS8_9</name>
							<description>IACTS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IACTS12_31</name>
							<description>IACTS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IACTR2</name>
					<displayName>IACTR2</displayName>
					<description>Interrupt ACTIVE Register</description>
					<addressOffset>0x304</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IACTS</name>
							<description>IACTS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IACTR3</name>
					<displayName>IACTR3</displayName>
					<description>Interrupt ACTIVE Register</description>
					<addressOffset>0x308</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IACTS</name>
							<description>IACTS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IACTR4</name>
					<displayName>IACTR4</displayName>
					<description>Interrupt ACTIVE Register</description>
					<addressOffset>0x30C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IACTS</name>
							<description>IACTS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IACTR5</name>
					<displayName>IACTR5</displayName>
					<description>Interrupt ACTIVE Register</description>
					<addressOffset>0x310</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IACTS</name>
							<description>IACTS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPRIOR0</name>
					<displayName>IPRIOR0</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR1</name>
					<displayName>IPRIOR1</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR2</name>
					<displayName>IPRIOR2</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x408</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR3</name>
					<displayName>IPRIOR3</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x40C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR4</name>
					<displayName>IPRIOR4</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x410</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR5</name>
					<displayName>IPRIOR5</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x414</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR6</name>
					<displayName>IPRIOR6</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x418</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR7</name>
					<displayName>IPRIOR7</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x41C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR8</name>
					<displayName>IPRIOR8</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x420</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR9</name>
					<displayName>IPRIOR9</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x424</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR10</name>
					<displayName>IPRIOR10</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x428</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR11</name>
					<displayName>IPRIOR11</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x42C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR12</name>
					<displayName>IPRIOR12</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x430</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR13</name>
					<displayName>IPRIOR13</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x434</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR14</name>
					<displayName>IPRIOR14</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x438</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR15</name>
					<displayName>IPRIOR15</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR16</name>
					<displayName>IPRIOR6</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x440</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR17</name>
					<displayName>IPRIOR7</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x444</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR18</name>
					<displayName>IPRIOR8</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x448</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR19</name>
					<displayName>IPRIOR9</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x44C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR20</name>
					<displayName>IPRIOR20</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x450</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR21</name>
					<displayName>IPRIOR21</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x454</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR22</name>
					<displayName>IPRIOR22</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x458</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR23</name>
					<displayName>IPRIOR23</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x45C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR24</name>
					<displayName>IPRIOR24</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x460</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR25</name>
					<displayName>IPRIOR25</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x464</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR26</name>
					<displayName>IPRIOR26</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x468</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR27</name>
					<displayName>IPRIOR27</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x46C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR28</name>
					<displayName>IPRIOR28</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x470</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR29</name>
					<displayName>IPRIOR29</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x474</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR30</name>
					<displayName>IPRIOR30</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x478</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR31</name>
					<displayName>IPRIOR31</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x47C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR32</name>
					<displayName>IPRIOR32</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x480</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR33</name>
					<displayName>IPRIOR33</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x484</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR34</name>
					<displayName>IPRIOR34</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x488</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR35</name>
					<displayName>IPRIOR35</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x48C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR36</name>
					<displayName>IPRIOR36</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x490</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR37</name>
					<displayName>IPRIOR37</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x494</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR38</name>
					<displayName>IPRIOR38</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x498</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR39</name>
					<displayName>IPRIOR39</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x49C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR40</name>
					<displayName>IPRIOR40</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR41</name>
					<displayName>IPRIOR41</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR42</name>
					<displayName>IPRIOR42</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4A8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR43</name>
					<displayName>IPRIOR43</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4AC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR44</name>
					<displayName>IPRIOR44</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4B0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR45</name>
					<displayName>IPRIOR45</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4B4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR46</name>
					<displayName>IPRIOR46</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4B8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR47</name>
					<displayName>IPRIOR47</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4BC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR48</name>
					<displayName>IPRIOR48</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4C0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR49</name>
					<displayName>IPRIOR49</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4C4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR50</name>
					<displayName>IPRIOR50</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4C8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR51</name>
					<displayName>IPRIOR51</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4CC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR52</name>
					<displayName>IPRIOR52</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4D0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR53</name>
					<displayName>IPRIOR53</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4D4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR54</name>
					<displayName>IPRIOR54</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4D8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR55</name>
					<displayName>IPRIOR55</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4DC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR56</name>
					<displayName>IPRIOR56</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4E0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR57</name>
					<displayName>IPRIOR57</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4E4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR58</name>
					<displayName>IPRIOR58</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4E8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR59</name>
					<displayName>IPRIOR59</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4EC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR60</name>
					<displayName>IPRIOR60</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4F0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR61</name>
					<displayName>IPRIOR61</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4F4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR62</name>
					<displayName>IPRIOR62</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4F8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR63</name>
					<displayName>IPRIOR63</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x4FC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR0</name>
					<displayName>IALLOCR0</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x600</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR1</name>
					<displayName>IALLOCR1</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x604</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR2</name>
					<displayName>IALLOCR2</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x608</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR3</name>
					<displayName>IALLOCR3</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x60C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR4</name>
					<displayName>IALLOCR4</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x610</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR5</name>
					<displayName>IALLOCR5</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x614</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
