Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup_2.svd
				<register>
					<name>IALLOCR6</name>
					<displayName>IALLOCR6</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x618</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR7</name>
					<displayName>IALLOCR7</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x61C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR8</name>
					<displayName>IALLOCR8</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x620</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR9</name>
					<displayName>IALLOCR9</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x624</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR10</name>
					<displayName>IALLOCR10</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x628</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR11</name>
					<displayName>IALLOCR11</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x62C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR12</name>
					<displayName>IALLOCR12</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x630</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR13</name>
					<displayName>IALLOCR13</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x634</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR14</name>
					<displayName>IALLOCR14</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x638</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR15</name>
					<displayName>IALLOCR15</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x63C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR16</name>
					<displayName>IALLOCR6</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x640</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR17</name>
					<displayName>IALLOCR7</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x644</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR18</name>
					<displayName>IALLOCR8</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x648</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR19</name>
					<displayName>IALLOCR9</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x64C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR20</name>
					<displayName>IALLOCR20</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x650</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR21</name>
					<displayName>IALLOCR21</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x654</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR22</name>
					<displayName>IALLOCR22</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x658</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR23</name>
					<displayName>IALLOCR23</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x65C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR24</name>
					<displayName>IALLOCR24</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x660</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR25</name>
					<displayName>IALLOCR25</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x664</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR26</name>
					<displayName>IALLOCR26</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x668</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR27</name>
					<displayName>IALLOCR27</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x66C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR28</name>
					<displayName>IALLOCR28</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x670</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR29</name>
					<displayName>IALLOCR29</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x674</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR30</name>
					<displayName>IALLOCR30</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x678</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR31</name>
					<displayName>IALLOCR31</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x67C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR32</name>
					<displayName>IALLOCR32</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x680</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR33</name>
					<displayName>IALLOCR33</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x684</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR34</name>
					<displayName>IALLOCR34</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x688</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR35</name>
					<displayName>IALLOCR35</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x68C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR36</name>
					<displayName>IALLOCR36</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x690</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR37</name>
					<displayName>IALLOCR37</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x694</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR38</name>
					<displayName>IALLOCR38</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x698</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR39</name>
					<displayName>IALLOCR39</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x69C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR40</name>
					<displayName>IALLOCR40</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR41</name>
					<displayName>IALLOCR41</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR42</name>
					<displayName>IALLOCR42</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6A8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR43</name>
					<displayName>IALLOCR43</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6AC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR44</name>
					<displayName>IALLOCR44</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6B0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR45</name>
					<displayName>IALLOCR45</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6B4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR46</name>
					<displayName>IALLOCR46</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6B8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR47</name>
					<displayName>IALLOCR47</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6BC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR48</name>
					<displayName>IALLOCR48</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6C0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR49</name>
					<displayName>IALLOCR49</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6C4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR50</name>
					<displayName>IALLOCR50</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6C8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR51</name>
					<displayName>IALLOCR51</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6CC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR52</name>
					<displayName>IALLOCR52</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6D0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR53</name>
					<displayName>IALLOCR53</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6D4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR54</name>
					<displayName>IALLOCR54</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6D8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR55</name>
					<displayName>IALLOCR55</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6DC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR56</name>
					<displayName>IALLOCR56</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6E0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR57</name>
					<displayName>IALLOCR57</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6E4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR58</name>
					<displayName>IALLOCR58</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6E8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR59</name>
					<displayName>IALLOCR59</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6EC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR60</name>
					<displayName>IALLOCR60</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6F0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR61</name>
					<displayName>IALLOCR61</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6F4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR62</name>
					<displayName>IALLOCR62</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6F8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IALLOCR63</name>
					<displayName>IALLOCR63</displayName>
					<description>Interrupt Allocation Register</description>
					<addressOffset>0x6FC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IAUTR1</name>
					<displayName>IAUTR1</displayName>
					<description>interrupts authority register 1</description>
					<addressOffset>0x700</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IAUT</name>
							<description>interrupt allocates all registers and is used to query whether the interrupt responds to each kernel allocation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IAUTR2</name>
					<displayName>IAUTR2</displayName>
					<description>interrupts authority register 2</description>
					<addressOffset>0x704</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IAUT</name>
							<description>interrupt allocates all registers and is used to query whether the interrupt responds to each kernel allocation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IAUTR3</name>
					<displayName>IAUTR3</displayName>
					<description>interrupts authority register 3</description>
					<addressOffset>0x708</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IAUT</name>
							<description>interrupt allocates all registers and is used to query whether the interrupt responds to each kernel allocation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IAUTR4</name>
					<displayName>IAUTR4</displayName>
					<description>interrupts authority register 4</description>
					<addressOffset>0x70C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IAUT</name>
							<description>interrupt allocates all registers and is used to query whether the interrupt responds to each kernel allocation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IAUTR5</name>
					<displayName>IAUTR5</displayName>
					<description>interrupts authority register 5</description>
					<addressOffset>0x710</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IAUT</name>
							<description>interrupt allocates all registers and is used to query whether the interrupt responds to each kernel allocation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKEIP0</name>
					<displayName>WAKEIP0</displayName>
					<description>PFIC wake-up instruction pointer register 0</description>
					<addressOffset>0x720</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IP_RELOAD0</name>
							<description>The PC address register on kernel C0 wake-up, which is used to reload the PC value after power-on wake-up and reset wake-up</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHUTDOWN0</name>
							<description>Kernel C0 Deep Sleep (Locked) Cancellation Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKEIP1</name>
					<displayName>WAKEIP1</displayName>
					<description>PFIC wake-up instruction pointer register 1</description>
					<addressOffset>0x724</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IP_RELOAD1</name>
							<description>The PC address register on kernel C1 wake-up, which is used to reload the PC value after power-on wake-up and reset wake-up</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHUTDOWN1</name>
							<description>Kernel C1 Deep Sleep (Locked) Cancellation Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
